#version: 0.2
ï ¼
ä ¸
ï¼ Į
ã Ģ
ç ļ
çļ Ħ
ãĢ Ĥ
ä º
ä »
å ı
æ ľ
å ħ
å Ī
ä ½
è ¿
å ¤
å ®
å ľ
æ Ī
å Ĳ
ç Ķ
æ ĺ
å Ĵ
åĴ Į
ä¸ Ģ
å Ĭ
æ ĸ
Ġ Ġ
è ¯
ç »
å ¹
ãĢ ģ
ä ¹
æĺ ¯
å °
è ®
å Ń
æ Ĺ
åľ ¨
å Ľ
ä» ¥
å º
é Ģ
ä ¼
å ¸
ä¸ ª
é ĩ
æ Ŀ
å į
äº º
å Į
ä¸ º
ï¼ ļ
ä¸ Ń
è ¡
æ ķ
æľ ī
ç ī
å Ĩ
åı ¯
å ¼
å ĩ
ĥ ½
å ·
å ¯
ç §
å ¾
è §
æĪ ĳ
æ ī
ç İ
è Ģ
å ¥
æ Ģ
¦ ģ
çĶ ¨
äº Ĩ
è ¦ģ
å ½
é Ĺ
ç Ń
ç Ľ
è¿ Ļ
æ ł
æ Ń
ä» ¬
è ĥ½
ä¸ į
æ ³
è ĩ
é Ŀ
å¹ ´
æ °
äº İ
è ´
æ Ķ
æ ŀ
æĹ ¶
é ¢
æ ĭ
çĶ Ł
ä ¿
æ Ĭ
å ĳ
åı¯ ä»¥
ç Ĳ
å ±
å ĵ
æ Ħ
å¤ §
ç º
æĪ Ĳ
åľ °
å ¦
å İ
è µ
ĠĠ ĠĠ
è¡ Į
æĸ ¹
æ İ
æ µ
ä¼ ļ
æ Ľ
æĿ ¥
è ¾
æ ¯
â Ģ
ä¸ Ĭ
åĪ °
å¯ ¹
å ¿
æ ĥ
çŃ ī
åĩ º
åŃ ¦
é Ļ
å¦ Ĥ
ä¸Ģ ä¸ª
ä ¾
ä½ ľ
æ Į
ä» ĸ
æ ı
é ľ
åĪ Ĩ
ä¸ ĭ
æ ¸
èĩ ª
åĽ ½
çī ©
æ ´
æ ²
é ĺ
æķ °
è ½
å¹ ¶
åı ĳ
å Ł
éľ Ģ
éĿ ¢
è ī
ï¼ ī
åĬ ¨
åħ ¶
ï¼ Ī
ç «
åĲ Į
è¿ ĩ
å¤ ļ
çĲ Ĩ
åĬ ł
å¥ ½
æ³ ķ
ç ®
åĲ İ
åŃ Ĳ
çİ °
æ į
æĽ ´
æĪĳ ä»¬
ç ±
ç§ į
æĸ ĩ
äº Ľ
æ ¬
è¿ Ľ
é ģ
Ġ |
ä½ ĵ
å® ¶
æ ±
ä½ ł
æ Ļ
çļĦ ç
å° Ĩ
é £
æı Ĳ
å® ļ
ä¹ ĭ
é «
é« ĺ
æľ Ģ
åĮ ĸ
æĢ §
éĢ ļ
åĬ Ľ
åº ¦
åħ ¬
åĵ ģ
ä½ ¿
é ķ
å ī
éľĢ è¦ģ
2 0
è¡ ¨
å »
ç ¨
ä¹ Ł
é ĥ
èĢ Į
è °
éĩ ı
ä¸ İ
å· ¥
åĲ Ī
éĹ ´
å° ı
æĪ ĸ
åħ ³
ä¿ Ŀ
åº Ķ
å¸ ¸
åĽ ł
ç ľ
æĹ ¥
ç Ĥ
- -
é¢ ĺ
éĩ į
åħ ¥
ç ³
i n
æľ Ī
è§ £
ç ½
è Ĥ
ä¸ »
å¾ Ĺ
æ Ĥ
ç ¾
è Ĭ
å ģ
å» º
å® ĥ
è ¶
ç ¤
æĦ Ł
æĸ °
æĥ ħ
éĹ ®
è® ¡
å ¢
æľ ¬
æŀ ľ
éĥ ¨
é ¦
ç ¬
ç Ħ
æį ®
åĪ ¶
æľ º
æĦ ı
èī ²
æī Ģ
å¼ ı
å¤ ©
æŃ ¤
çī ¹
ç» ı
éķ ¿
è ·
åĲ į
ç¨ ĭ
ä» £
å Ģ
è ¢
å® ŀ
ä¸ ļ
å¼ Ģ
æ° ´
ç± »
ï¼ Ł
ç ¡
å¸ Ĥ
çĦ ¶
å Ŀ
èĢ ħ
åĮ º
çĶ µ
ç Ł
é ¡
å½ ĵ
è® ¾
é Ķ
åĨ ħ
éĢ ī
0 0
åı Ĭ
äº §
è ģ
æ Ł
ç ©
çĽ ¸
å §
ç³ »
æ ģ
ç¾ İ
ä½ į
ä½¿ çĶ¨
é ħ
1 9
è¯ ¥
å¿ ĥ
é ļ
æĤ ¨
ç ´
âĢ ľ
âĢ Ŀ
é Ľ
ç ķ
çĤ ¹
è¢ «
e r
äº ĭ
å¹ ³
æĺ İ
ç Ŀ
æ¯ Ķ
éĹ® é¢ĺ
éĩ Į
a n
o n
åħ ¨
åĮ ħ
ä½ Ĩ
æ ·
åľ º
é ĥ½
åĳ ĺ
ç ĥ
ä» »
åī į
éģ ĵ
æ° Ķ
çĲ ĥ
æĬ Ģ
ĠĠ Ġ
å¤ ĸ
å½ ±
åĪ ©
åħ ·
ç ¼
ç ł
è Ĳ
æĮ ģ
éĢ Ĥ
è¿Ľ è¡Į
æ´ »
çĶ ±
åĬ ¡
é Ĥ
æł ¼
ä¿ ¡
ç¡ ®
è´ ¨
è¯ Ń
æľ Ł
é ª
è ĭ
o r
æ ¡
å £
è Ī
æ ¶
t h
å· ±
å ŀ
å± ķ
èĩª å·±
çĽ ®
è® ©
æĢ »
ç» ĵ
èµ ·
ãĢ ĭ
ãĢ Ĭ
ä¾ Ľ
æĸ ¯
ç¬ ¬
ä¸Ģ äºĽ
åı ĺ
ä» İ
è¿ ĺ
æľ ¯
è½ ¦
å® ī
çĿ Ģ
çİ ¯
è¯ ·
éĿ ŀ
äº ¤
åĬ ©
ç Ī
åı Ĺ
æ¬ ¡
ç» Ļ
æµ ·
è İ
è º
æŃ £
å ĸ
é Ł
ä¹ Ī
è¿Ļ ä¸ª
ä¸ ī
è ¥
_ _
åħ ĥ
è¯ ´
åı ¸
ä¾ ĭ
æ¯ ı
è¥ ¿
é ©
æī ĭ
èº «
åı £
é£ Ł
åį ķ
è į
å½ ¢
åŃ Ĺ
å¾ Ī
è® ®
ç ģ
ç® Ĺ
ç ¥
ç» Ł
å° Ķ
å¥½ çļĦ
é »
ä¸ ¤
Ġ 1
æĥ ³
r e
éĢļ è¿ĩ
è¿ Ĳ
è Ļ
å ķ
æıĲ ä¾Ľ
æ± Ĥ
ç§ ĳ
ç« ĭ
è ĥ
æ »
é£ İ
æĶ ¿
Ġ =
æł ¹
æĪ ·
ä¹ Ĳ
æĭ ¬
æ³ ¨
åŁ º
æ ®
e n
åı¯ èĥ½
åŀ ĭ
æĹ ł
æ ¼
æµ ģ
å¸ ®
æ° ĳ
ç» Ħ
å Ļ
ĠĠĠĠ ĠĠĠĠ
åħ ĭ
æķ Ļ
è £
èĩ ³
è° ĥ
çº ¿
åĮħ æĭ¬
æĺ¯ ä¸Ģ
æĶ ¾
ä¸į åĲĮ
è¾ ¾
æ¸ ¸
åĽ ŀ
æĭ ©
æĮ ĩ
ç ĭ
éĢī æĭ©
ç ĸ
å¦Ĥ æŀľ
ä½ ķ
ç Ļ
æĺ Ł
ä»¥ ä¸ĭ
a t
åĨ ³
ä»ĸ ä»¬
åį Ĺ
ä¸ ĸ
Â ·
é ¥
åĪ Ľ
èĬ Ĥ
å¤ Ħ
éŁ ³
é ĵ
åĲ ĳ
ä¹ ł
é¦ ĸ
åĻ ¨
åĪ Ĺ
æł ĩ
ç ²
é Ĵ
åħ¬ åı¸
å¯ ¼
åĨ Ļ
æĸ Ļ
åħ ±
å¼ º
ç ¦
ä» ¶
æİ ¥
è ±
æ º
å° ±
å° ĳ
è· ¯
æķ Ī
å¢ ĥ
éĩ ĳ
å¤ Ł
è¿Ļ äºĽ
éĺ Ł
åİ Ł
èµ Ħ
éĿŀ å¸¸
æŃ ¥
` `
s t
æĪ ĺ
ä¼ ł
éĤ £
ç¤ ¾
a r
åı ĸ
æģ ¯
ï¼ Ľ
åŁ İ
éĩį è¦ģ
åĪ Ļ
åĵ į
è§ Ĥ
æł¹ æį®
ç¤ º
è® ¤
åĨ Ľ
ä» ·
åı °
æ¸ ħ
ç´ ł
å® ¹
ä¸Ń çļĦ
æľ į
åħ ī
äº Į
éĢ ł
åĮ Ĺ
è ı
å¾ ·
æĻ º
çŁ ¥
-- --
ç® ¡
åĪ «
1 0
ç© º
å ²
èĢ ĥ
æķ° æį®
å¸ ĥ
æĶ ¯
å± ±
åİ Ĩ
æĶ ¹
åĲ Ħ
æł ·
ä¹ ī
å Ķ
èµ Ľ
åİ »
å¤ ĩ
æİ ¨
æķ ´
å® ¢
å¸® åĬ©
è¿ °
ä¸ ľ
a l
åĲĮ æĹ¶
ç± ³
è® º
åħ Ī
å½± åĵį
çķ Į
å¢ ŀ
åı į
çľ ĭ
é¢ Ĩ
è Ħ
åĢ ¼
ç Ĭ
åŃ ĺ
å¸ ¦
æ ¤
æ £
æĹ¶ éĹ´
æĬ ¤
èĩªå·± çļĦ
è Į
åı ª
æ¡ Ī
åıĳ å±ķ
æ· ±
å¤ ª
åĽł æŃ¤
è¯ ķ
èĥ½ å¤Ł
l e
o u
åı Ĥ
è§ Ħ
æ® µ
å§ ĭ
çº ¦
èģ Ķ
å¹ ¿
åķ Ĩ
è ĳ
åº ı
èĬ ±
éª Į
åĬ Ł
åħ¶ ä»ĸ
ä» Ģ
çĽ ´
äº ļ
ä¼ ĺ
ä¸Ń åĽ½
é¡ ¹
èĭ ±
ç§ ¯
è§ Ĩ
åģ ¥
ç§ °
æĬĢ æľ¯
ä» ½
æĸ¹ å¼ı
æº Ĳ
è¾ ĥ
è ¨
åĪ Ĵ
è¨ Ģ
è®¾ è®¡
çİ¯ å¢ĥ
è¯ Ŀ
å® Į
è£ ħ
æ ¨
æĶ ¶
å®ĥ ä»¬
å¼ ķ
ç» ´
ä¾ĭ å¦Ĥ
ç Ĺ
æĻ ¯
é© ¬
æĢ ģ
ç ħ
æ¸ ©
æĭ ī
å· ²
æ² ¡
æ¼ Ķ
ä»Ģ ä¹Ī
åŁ Ł
æĻº èĥ½
è¯ į
åĩ Ĩ
éħ į
åĨ µ
è§ Ĵ
çĪ ±
Ġ c
é ¸
åį ģ
å·¥ ä½ľ
æĿ Ĳ
æĸ Ń
èİ ·
ç Į
æľ ª
åĳ ³
çĶŁ æ´»
åĳ Ĭ
æ ¹
ä¸ Ķ
çİ ĩ
Ġ s
è¶ ³
æĸ¹ æ³ķ
æŁ ¥
è¯ Ĩ
ç« Ļ
åĽ ¢
æıĲ é«ĺ
æŀ ģ
çľ ģ
åı ·
æĢ Ŀ
å± ŀ
ç» Ĩ
æĸ¹ éĿ¢
Ċ ĠĠĠ
å ¡
è®¡ ç®Ĺ
æİ Ĵ
æĿ ¡
ä¹ ¦
ç® Ģ
e l
åı ²
äº§ åĵģ
å»º è®®
ä»¥ åıĬ
åģ ļ
éĺ ³
Ġ a
åº ·
ä¿¡ æģ¯
æ¨ ¡
æ² »
ç¼ ĸ
å¦Ĥ ä½ķ
ç½ ®
éĢ Ł
æĪ ı
è¾ ĵ
åºĶ è¯¥
è± ¡
ç½ ĳ
èĩ ´
Ġ t
æµ ĭ
å¤ į
å£ «
åĳ ½
Ġ th
åį İ
é¢ Ħ
çł ģ
è½ ¬
åĩ ı
åŃ¦ ä¹ł
æŀ Ħ
ç ¯
æĺ¯ ä¸Ģä¸ª
ç ¿
å¥ ¹
å¥ ³
å· ŀ
éĹ ¨
åį ³
åĮ »
æ²¡ æľī
æĬ ¥
åĽ Ľ
æī ¾
Ġ p
æ Ĵ
åĽł ä¸º
é¦ Ļ
i c
éĽ Ĩ
è´ ¹
èĲ ¥
æ ĳ
æ¬ ¢
æĪ ¿
æī ĵ
æ» ¡
è¿ ĳ
èı ľ
i t
e s
20 1
å¿ «
éļ ı
æĽ´ åĬł
çŃ Ķ
ãĢ Į
ãĢ į
åĸ ľ
i s
20 0
æĪĲ ä¸º
é ²
ï¼ī ï¼Į
è® ¸
ä¸ª äºº
çĥ Ń
åı ¥
æŃ Į
æĸĩ åĮĸ
çĻ ½
ç³» ç»Ł
è¯ ģ
å¤ ´
æ¸¸ æĪı
æ ¢
çº ¢
Ġ f
ç» Ń
ä¹ĭ éĹ´
æ Ĳ
in g
å¼Ģ å§ĭ
æĺ ĵ
è¯ Ħ
æľį åĬ¡
æ ļ
ä¸» è¦ģ
éĻ ¢
åĲ ¦
çĬ ¶
è® °
è¶ Ĭ
éĻ ħ
äºº ä»¬
çĶ¨ æĪ·
ä¸ĸ çķĮ
åģ¥ åº·
æĥħ åĨµ
ç« ł
ç¥ ŀ
ä¸ ĵ
u m
åħ »
å ¨
æ´» åĬ¨
åĨ į
éĶ Ģ
è½ »
ç© ¶
åĳ ¨
__ __
æķ ħ
æŀ Ĺ
èĩª çĦ¶
çī ĩ
çº §
çİ ĭ
å ĭ
èĻ ĳ
ç¦ »
è¿ĩ ç¨ĭ
å®ī åħ¨
åħ į
è´ Ń
å¯ Ĩ
åºĶ çĶ¨
å¸ Ī
èĤ ²
åĩ ł
Ġ m
ä¹ĭ ä¸Ģ
èī º
èģ Į
è§ ģ
åħ¶ ä¸Ń
äºĨ è§£
éĩ ĩ
ä¾ ¿
ä¿Ŀ æĮģ
ç¯ ĩ
å¼ ł
éŁ³ ä¹Ĳ
æĸ ½
æ¤ į
o m
ç ¢
çī Į
Ġ 2
éĻ ¤
ä¿ ®
åŁİ å¸Ĥ
äº Ĵ
çļĦ äºº
æı ı
æ¶ Ī
çł Ķ
åº ľ
è¿Ĳ åĬ¨
æŀ Ĳ
Ġ d
Ġ b
ç½ Ĺ
åº Ń
ç¤¾ ä¼ļ
è Ľ
Ġ w
æ¬ ¾
ĠĠĠĠ ĠĠĠ
åı ¤
æİ §
æ² ¹
çļĦ ä¸Ģ
an d
éĻ ©
è° ¢
åŃ ©
åį ĩ
ä½ İ
çĭ ¬
é ¾
å· ´
ç ı
æĬ ķ
åĽ ´
æľ Ľ
ç» ĥ
æ³¨ æĦı
åħ³ ç³»
å¯¹ äºİ
äº Ķ
äºº ç±»
Ġ n
èĤ ī
ç®¡ çĲĨ
åİ ¿
æ ħ
åĽ ¾
è Ĵ
èĥ½ åĬĽ
åĿ ĩ
ä½Ĩ æĺ¯
åĪĨ æŀĲ
é» ĳ
çŃ ĸ
`` `
åħ ħ
çľ Ł
åħ³ äºİ
¤ Ĳ
è ħ
æĽ ²
in t
è§£ åĨ³
å®ŀ çİ°
Ġ -
1 2
åĲ «
ä¸ ĩ
è®¤ ä¸º
a c
ä» ħ
åħ· æľī
è¯ »
åħ °
ç¾İ åĽ½
ç¬ ¦
å Ħ
å° ¼
é ¤Ĳ
è¯Ń è¨Ģ
åĲ ¸
å¿ ħ
ä¸įåĲĮ çļĦ
åŃ £
ç² ¾
çĹ ħ
éķ ĩ
åĪ¶ ä½ľ
å¾ ĭ
éļ ¾
åĲ Ĺ
åį ¡
æĹ ħ
åĨħ å®¹
äºº å·¥
åĢ Ļ
æĪĳä»¬ çļĦ
éĥ¨ åĪĨ
Ġ "
éĺ ²
ä½ł çļĦ
åİĨ åı²
æī į
çĶµ å½±
åĬł åħ¥
å¤ ±
æĸĩ ç«ł
ç ª
ç» Ī
éĢļ å¸¸
å ł
ç¡® ä¿Ŀ
å® Ŀ
èĢĥ èĻĳ
æĺ¯ä¸Ģ ç§į
åĦ ¿
åĪ° äºĨ
æīĢ æľī
å®¶ åºŃ
Ġ å¥½çļĦ
Ġth e
çĸ Ĺ
ä¿Ŀ æĬ¤
èº« ä½ĵ
ä¸¤ ä¸ª
è§ ī
åĲ ¬
çħ §
æ ĵ
å¾ Ģ
1 8
å¤§ çļĦ
çģ «
æİ ¢
æ¯ į
åħ ´
ç ĵ
åĬ ¿
åĶ ®
äº ī
æĽ´ å¤ļ
è®¸ å¤ļ
è´¨ éĩı
æľĢ åĲİ
èİ· å¾Ĺ
æĿ ĥ
å¤Ħ çĲĨ
å¸ Į
éľĢ æ±Ĥ
ç´ ¢
å ©
æ² ³
åı ĭ
äºº çļĦ
é» Ħ
éĺ ¿
å° ½
æıı è¿°
è¾ ¹
æĪĸ èĢħ
å® ¤
è®¡ åĪĴ
æĸĩ æľ¬
é¢Ĩ åŁŁ
æ ¦
äººå·¥ æĻºèĥ½
å¹ ²
å¸Ĥ åľº
ï¼ ģ
åı ¦
å± ħ
çŁ ³
åĩ »
è¿Ļ ç§į
çĶŁ æĪĲ
çłĶ ç©¶
éģ ¿
æĻ ®
ä½į äºİ
i on
Ġ 3
ä» Ĭ
ç»ĵ æŀľ
a s
éĩ Ĭ
å¯ Į
æĶ¯ æĮģ
a m
åĪ ĩ
åį ı
æĺ¯ åĲ¦
Ġ S
æĽ ¾
éĢĤ åĲĪ
ä½ľ ä¸º
ä»£ çłģ
äº «
æĿĲ æĸĻ
ä¸į æĸŃ
å¢ŀ åĬł
åŃ© åŃĲ
e d
èĽ ĭ
å·² ç»ı
åĸľ æ¬¢
èĳ Ĺ
å¯¼ èĩ´
ä¸ ¾
åıĳ çİ°
ä¸Ģ ç§į
å ĥ
èĢ ģ
åŃĺ åľ¨
çŃ ĳ
åľ Ł
å£ °
å± Ĥ
1 5
ç¦ ı
çĽ® æłĩ
åİ ĭ
éĵ ģ
Ġ o
åĽ Ń
åľ° åĮº
æĮ ī
åĬ¨ çī©
èĲ ½
è¶ £
ç¨ĭ åºı
ä» ĭ
æ¤į çī©
00 0
æĥħ æĦŁ
æľª æĿ¥
æ³ ¢
ä¼ Ĺ
ä¸Ģ ä¸ĭ
çĶ »
ä¹ °
r o
æł ¡
éħ Ĵ
é ±
åī §
è¯ Ĺ
æ¸ ¯
è´ Ł
å± Ģ
è¿ ŀ
å· §
ç ĳ
åĽŀ çŃĶ
æĬ Ĭ
é± ¼
åĪ Ŀ
äº ²
å»º çŃĳ
çİ ©
Ċ ĠĠĠĠĠĠĠ
åĲĦ ç§į
å®ļ çļĦ
è® Ń
æŃ¤ å¤ĸ
åıĺ åĮĸ
å¿ µ
åĩı å°ĳ
å»º ç«ĭ
æĸ° çļĦ
éĻ Ĳ
äº§ çĶŁ
åĵ ª
éĤ£ ä¹Ī
åĬŁ èĥ½
é¦ĸ åħĪ
é¥ ®
e t
æį ¢
l o
ä¸ ½
éĩįè¦ģ çļĦ
èī ¯
æĶ¿ åºľ
å¤ ı
ï¼ī ãĢĤ
åľ° çĲĥ
Ġ re
çİ° åľ¨
Ġ in
æķħ äºĭ
çĦ¶ åĲİ
çº ³
åĵģ çīĮ
æ´ ²
éģ¿ åħį
å½ ķ
åĨĻ ä¸Ģ
ä¼ ģ
çĶ¨ äºİ
ä¸Ĭ çļĦ
è¡Į ä¸º
æĿ İ
åº §
éĻ į
è´ £
çº ª
å§ Ķ
è¯ ī
1 1
æ¯ı ä¸ª
æĿ ¾
ä» ¤
å®¢ æĪ·
å® ĺ
é¢ ľ
åĥ ı
å¹¶ ä¸Ķ
è¶ ħ
ç Ĩ
è¿ ľ
æĽ´ å¥½
æµ İ
äº ¬
ä»£ è¡¨
u l
ç§ĳ åŃ¦
èīº æľ¯
çĶ± äºİ
äºº åı£
æĪĳä»¬ åı¯ä»¥
çĲĨ è§£
æķĻ èĤ²
i l
æİ§ åĪ¶
å¥ ¥
Ġ A
y th
å¤ª éĺ³
æĤ¨ çļĦ
en t
èį ī
éĶ ®
å¯ »
è´ ¢
Ġ h
u r
èĮ ĥ
Ġ i
Ġ C
åı Ī
é£ ŀ
åĸ Ħ
å®Į æĪĲ
çī Ľ
éĶ Ļ
æĺ ¾
æ² Ļ
éª ¤
5 0
Ġ +
è¡¨ è¾¾
æĭ ¥
æĸ¹ æ¡Ī
çķ ¥
æŃ¥ éª¤
ä¼ģ ä¸ļ
é£İ æł¼
Ġ and
åĩº çİ°
yth on
è® ²
åĿ Ĺ
è¡¨ ç¤º
ä½ ı
é¸ ¡
åħ ¸
3 0
ä¸Ģ èµ·
åĩ ½
ä»ĸ çļĦ
åĪĨ ç±»
ä¸» é¢ĺ
Ġt o
æ ¿
å¤§ åŃ¦
é¾ Ļ
å¾ ģ
æ£ Ģ
ä»· æł¼
åĬ ŀ
æĹ ı
çĽ¸ åħ³
éĿ¢ ç§¯
äº¤ éĢļ
é¢ľ èī²
Ġ (
åı Į
æĽ´å¥½ åľ°
çĶ ·
20 2
çĥ ¤
ç®Ģ åįķ
æ ½
åħĥ ç´ł
ä¹ĭéĹ´ çļĦ
ä»» åĬ¡
ç¿ »
è¾ĵ åħ¥
æľ ¨
å¥ ĩ
é ¼
ç» į
åį «
u t
ä»¥ä¸ĭ æĺ¯
åħ· ä½ĵ
æķ° åŃĹ
åĩ½ æķ°
å¸¦ æĿ¥
åı¯èĥ½ ä¼ļ
åº Ĺ
çĽ Ĭ
å® ³
ä¹Ł æĺ¯
å¾Ĺ åĪ°
æ± Ł
åħ ļ
æ´ ĭ
ç² ī
è¿Ļ æł·
ä»· åĢ¼
ä½ľ çĶ¨
è¦ģ æ±Ĥ
æĪĲ åĬŁ
u s
æŁ Ĳ
l i
å¤ «
éĿ Ĵ
åİ ħ
åį °
ç»ı æµİ
å° Ŀ
Ġ T
åıĹ åĪ°
ä½ľ åĵģ
åıĳ çĶŁ
è¡¨ çİ°
çĭ Ĺ
æ ¥
åĽ¢ éĺŁ
çİ° ä»£
åı ¶
å² Ľ
è ŀ
éĶĢ åĶ®
çļ ®
æ¿ Ģ
è ĵ
ç¬¬ ä¸Ģ
èµ °
å¥ ¶
é¢ Ŀ
æ¯Ķ èµĽ
æĭ ħ
çŁ Ń
ä¼ ¼
Ġ åľ¨
åĪ ¤
æł ĳ
éĴ Ł
19 9
æŃ ¢
å¾Ī å¤ļ
ä¼ł ç»Ł
ä»¥ ä¸Ĭ
å¾ ®
ç» ĩ
æĹ ©
d e
ç¾ ¤
å¹³ æĸ¹
Ġ y
ä»ĭ ç»į
r int
èĪ ŀ
å¸Į æľĽ
å¨ ģ
ç» ¿
å° Ħ
åĽł ç´ł
ç¡® å®ļ
å¿ Ĺ
æľ Ŀ
æĵ į
é² ľ
æĮ ĳ
æ¯Ķ å¦Ĥ
çļĦ ä¸Ģä¸ª
r i
ç»ĵ æŀĦ
åĪ© çĶ¨
ä¸Ģ ä»½
æ¹ ¾
åĳĺ å·¥
æĿ Ĥ
Ġ å½ĵ
æ² Ł
å¥ ĸ
æĹł æ³ķ
çŃī çŃī
æ´ ģ
---- ----
ç±» åŀĭ
Ġ 5
æĿ ¿
å Ĥ
çļĦ éĹ®é¢ĺ
æ¯Ķ è¾ĥ
è§£ éĩĬ
c h
è´Ń ä¹°
ç¼ º
å¼ Ĥ
ç¬¬ äºĮ
é º
é¦ Ĩ
çļĦ æĺ¯
ä¸Ń å¿ĥ
è½ ¯
çĶŁ åĳ½
è¿ ½
èĥ Į
ç§ »
ä¸ °
Ġ 4
çļĦ å½±åĵį
ç» §
åº ķ
æľº åĻ¨
é¡¹ çĽ®
ä»» ä½ķ
åĪ »
æĢ§ åĴĮ
å® £
åı¯ä»¥ å¸®åĬ©
çķ Ļ
ä½ĵ éªĮ
ä»İ èĢĮ
âĢ Ķ
æĬķ èµĦ
èĲ ¨
åħ¬ éĩĮ
è Ĺ
ä»ĸä»¬ çļĦ
a y
åı¥ åŃĲ
è ľ
ç¤ ¼
ä¸į ä»ħ
å½¢ æĪĲ
ç³ ĸ
v e
æĿ¥ è¯´
çĶŁ çī©
o l
ä¸º äºĨ
æ¦ Ĥ
å¯ Ł
æĭ¥ æľī
èĪ Ĵ
æľĢ ç»Ī
é Ń
æľī æķĪ
1 6
Ġ I
æĴ Ń
å¯¹ è¯Ŀ
è¯ ĳ
g e
s e
å· ®
æĻ ļ
å© ļ
åį ĥ
Ġo f
Ġ P
çī Ī
ç§¯ æŀģ
åħ³ éĶ®
èį Ĳ
çª ģ
æŁ ĵ
éĢ Ĳ
èĭ ı
ç§ĳ æĬĢ
ä¸į æĺ¯
åŃ¦ çĶŁ
åħ³ æ³¨
äºº æ°ĳ
Ċ ĠĠĠĠĠĠĠĠ
âĢĿ ãĢĤ
é¥ °
çĮ «
æİ¨ èįĲ
äº ĳ
æĬĢ å·§
Ġ 0
éĻ Ĩ
é¡ »
Ġ M
çī¹ çĤ¹
X X
å¼Ģ åıĳ
Ġ B
æķ £
æīĢ ä»¥
åĴ ĸ
æĿ ¯
æī ¿
è Ń
çļĦ åľ°
è® ¨
è¿ĩç¨ĭ ä¸Ń
å½ ©
æ²Ł éĢļ
æĶ »
éĥ½ æĺ¯
æĪĳ çļĦ
æĢ» ä¹ĭ
å®ĥ çļĦ
æł ¸
åħ¨ çĲĥ
æĮĳ æĪĺ
æŃ£ ç¡®
è®¾ å¤ĩ
è¿ĺ æľī
åŁº æľ¬
åĩĨ å¤ĩ
èŃ ¦
å°ı è¯´
éĩĩ çĶ¨
éĩı çļĦ
ç» ľ
æ¬ §
è¯ ¯
âĢĿ ï¼Į
æī¾ åĪ°
ç¥ ¨
çĽ ĳ
åĲĪ ä½ľ
( "
c t
æ´ ¾
æĽ´å¤ļ çļĦ
ç»Ħ ç»ĩ
æ¸ Ĳ
ä¼ ¦
åĳ ¢
æĦŁ åĪ°
è®Ń ç»ĥ
ç»Ļ æĪĳ
ä¸ ¥
åħ Ń
åıį åºĶ
èµ· æĿ¥
çī© è´¨
åĳĬ è¯ī
èµĦ æºĲ
ä½į ç½®
æī §
å°Ŀ è¯ķ
çģ µ
åķ ¡
æĪĳä»¬ éľĢè¦ģ
æ° §
åģ ĩ
æ´ Ĺ
æĮģ ç»Ń
éĿ Ļ
æ± ½
åį Ĭ
è¯ ¦
æĢ§ çļĦ
çŁ¥ éģĵ
å¾ ħ
æ± ī
åı¯ä»¥ éĢļè¿ĩ
åĴĸ åķ¡
æĵį ä½ľ
æĿ ĳ
èŀ į
çİ¯ ä¿Ŀ
Ġ '
äºĨ ä¸Ģ
åĵ Ī
Ġ æĪĳ
i m
å² ģ
èį ¯
å¡ Ķ
æ³ Ľ
åĽ½ å®¶
1 7
åĬ ±
éģ ĩ
å¤© æ°Ķ
åĪĹ è¡¨
åĪĽ éĢł
åĨ °
è§Ĵ èī²
æ· ·
ç ĩ
åıĤ åĬł
åŁ ¹
èĪ ª
çĶµ è§Ĩ
å¿ĥ çĲĨ
èĩª çĶ±
ä¾ Ŀ
ä¸ĵ ä¸ļ
é¦Ļ æ¸¯
å ³
åį ļ
è¾ĵ åĩº
çı Ń
è¡ £
____ ____
æĲ Ń
å·¥ åħ·
å½ Ĵ
çĽ Ĳ
è¾ ĳ
h e
åŁº ç¡
å° ļ
a d
æŃ ¦
çļĦ éĩįè¦ģ
åŁºç¡ Ģ
è¡ ¡
1 4
u n
è Ķ
ä¸ ´
å½ĵ åľ°
æ³ķ åĽ½
åĪ¶ å®ļ
Ġ e
æ¨¡ åŀĭ
çĶŁ äº§
ä¼ ¤
å· ¦
ä¹ ¡
é£Ł çī©
åģ ľ
åĮħ åĲ«
ç« ŀ
èĥ ľ
å°± æĺ¯
å ª
æīį èĥ½
åĮ» çĸĹ
å° Ĭ
ç»Ħ æĪĲ
åĿ ļ
æĹ¥ æľ¬
è· Ŀ
ä¸į èĥ½
åħ¬åı¸ çļĦ
æĺ ¥
èĵ Ŀ
æķ° éĩı
åı¯ä»¥ åľ¨
æ¯ Ľ
å¿ħ é¡»
åĪĨ éĴŁ
2 5
çļĦç ¾
çĻ ¾
æŃ »
éļı çĿĢ
çĶµ åŃĲ
æ¸© åº¦
çĪ ¶
åı ³
åº ĵ
ä» ĺ
éħ ¸
åĨĻä¸Ģ ç¯ĩ
æķĪ æŀľ
æħ ¢
æ¥ ¼
æ´ ŀ
éĴ Ī
ä» į
æ£ ®
æĳ Ħ
æ¹ ĸ
éĢŁ åº¦
è¡Į æĺŁ
åĳ ¼
ä¹ ĺ
åĨ ľ
è¯¦ ç»Ĩ
éĵ ¶
é Ĩ
åľ £
åıĤ ä¸İ
åĲ ĥ
éĻ Ī
ä¿ ĥ
é£İ éĻ©
èĪĴ éĢĤ
19 8
å®ŀ éĻħ
èĪ ¬
i d
æĬĢ èĥ½
å¤ ľ
åħ «
å¹¿ æ³Ľ
å® Ĺ
ç¨ ³
( )
Ġ g
åĬĽ åĴĮ
å±ŀ äºİ
å® Ī
åį ł
çļĦ æĹ¶
åĽ °
Ġf or
çł ´
åħ± åĲĮ
åįķ è¯į
è¿Ļ æĺ¯
ç½ĳ ç»ľ
o t
æľ ĭ
çĽ ĸ
æİ ª
v er
ç« ¯
éĽ ¨
ä¼ Ĭ
åħ µ
è± Ĩ
é¸ Ł
åŃĹ ç¬¦
èĻ ½
äº ®
ä½ Ļ
æķ´ ä¸ª
çĶŁ æĢģ
çī Ļ
1 3
æ¶Ī è´¹
ç§ ĺ
Ġ 6
æĦı ä¹ī
åı° æ¹¾
ä¹ĭ åĲİ
éĽ ·
ä¸° å¯Į
åį ´
ç©º éĹ´
ç»ı éªĮ
åĤ ¨
ç© ¿
éĹ »
ä½ ³
g h
äºĭ ä»¶
æĿ¡ ä»¶
çļĦç ¬
åĮĸ åŃ¦
åĬ ª
èĤ ¤
çĻ »
çļĦ åıĳå±ķ
é¡ º
æİ Į
æĪĲ åĳĺ
çŁ¥ è¯Ĩ
çĶ ²
è¡ Ĺ
å® ĩ
èī² çļĦ
ç¿» è¯ĳ
ä¸į è¦ģ
ç» ª
æ±½ è½¦
å ĺ
èĦ ĳ
ç´ §
åĨ³ å®ļ
æľĭ åıĭ
æ· »
ä¹Ł åı¯ä»¥
çļĦç¾ İ
æıĲ åĩº
éĺ ħ
è°ĥ æķ´
åĽ½ éĻħ
1 00
åª Ĵ
è¯ ¢
è ĸ
æķĪ çİĩ
æ°Ķ åĢĻ
åıĺ å¾Ĺ
æĸĩ åŃ¦
ç» ¼
å¤§ åĪ©
åĬł å¼º
é¢ ĳ
è¿ İ
éĢ ı
åĲį ç§°
åĨ ·
å½¢ å¼ı
èĤ ¡
ç§ ĭ
æĮī çħ§
æĺ¯ åľ¨
a p
éĢł æĪĲ
çĦ¶ èĢĮ
è¡Į æĶ¿
æľº ä¼ļ
å®¹ æĺĵ
èĹ ı
äºº åĳĺ
æľĢ è¿ĳ
æİª æĸ½
ä¸ ²
æĦ ¿
çī¹ å¾ģ
æ´ Ľ
P ython
æī ¹
éħ ±
åĮĹ äº¬
å®ŀ éªĮ
æį Ł
èĻ½ çĦ¶
åĭ Ĵ
è¡¨ æł¼
å¸ Ŀ
Ġy ou
Ġ $
çī¹ åĪ«
ç»Ļ åĩº
åī ¯
çĨ Ł
å¯» æī¾
åĩł ä¸ª
é¡ ¿
æ¢ ¦
äºĨ ä¸Ģä¸ª
æ ¾
è¯· éĹ®
æµ ª
ç® ±
äº¤ æµģ
æİ¢ ç´¢
ç¤¾ äº¤
èĮ ¶
åıª æľī
æ± ¡
æŀ ¶
å® ł
æļ ĸ
åĢ Ĵ
æ£Ģ æŁ¥
åĪĨ åĪ«
o w
åŁº äºİ
ç®Ĺ æ³ķ
å¹³ åĿĩ
çĵ ¦
é«ĺ çļĦ
e m
ç§° ä¸º
çĮ ®
å¾ ª
å¸¸ è§ģ
ç»§ ç»Ń
n t
ä½¿ å¾Ĺ
ä¸Ń åįİ
å¤į æĿĤ
å· ¨
æ²» çĸĹ
ä¸Ģ çĽ´
åķĨ åĵģ
åĪĽ ä½ľ
éĿ ©
ä¸ī ä¸ª
çĤ Ĵ
é£Ł åĵģ
æµĭ è¯ķ
è¯ º
é¡ ¾
èĩª æĪĳ
å§Ķ åĳĺ
å¦Ĥæŀľ ä½ł
Ġ 8
Ġn um
åĲ ī
è Ĩ
æĪĳ æĥ³
or t
c e
æĬ¥ åĳĬ
èģĮ ä¸ļ
æ¤ Ĵ
æ³ķ å¾ĭ
i f
å®ĥä»¬ çļĦ
è¿Ľ åħ¥
ä½ Ľ
Ġ L
åĲ¸ å¼ķ
çİ© å®¶
ç £
éĻ Ħ
ä¸ ĥ
æ»¡ è¶³
é¼ ĵ
å§ Ĩ
ï¼ļ âĢľ
èĮĥ åĽ´
èĭ± åĽ½
è§Ħ åĪĴ
ä¼ °
ä¸ĸ çºª
éĩ İ
ä¹ Ŀ
å¡ ŀ
å¹´ çļĦ
ä¸» ä¹ī
éĢ ģ
æĢĿ èĢĥ
æĺ¯ æĮĩ
çľ ¼
é ¹
ä¸Ģ æ¬¡
ä¸Ģ æŃ¥
æłĩ åĩĨ
" )
Ġ D
å®ł çī©
u e
è½ ®
èİ ±
çĭ¬ çī¹
æľ «
æ ©
çĥ Ī
è¡Į åĬ¨
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
åİŁ åĽł
æģ ©
è¡ Ģ
Ġå½ĵ çĦ¶
éļ ľ
åĲ §
æľī åħ³
è´ Ŀ
å¤© çļĦ
ç¼ ĵ
æ° ¸
ç» Ŀ
è´ µ
æ¼ «
åĨ ²
çĽ ĺ
åł Ĥ
or d
å¹ ¸
äº ¦
ä¸į ä¼ļ
è·Ŀ ç¦»
Ġ {
æĶ¹ åıĺ
åħħ æ»¡
Ġ H
æĶ¿ æ²»
åĩ Ģ
æĹħ æ¸¸
æĿ Ł
éĥ½ æľī
æĹ¶ æľŁ
äºº çī©
æľŁ éĹ´
æ¶ ²
éĶ ħ
çº ¸
éĺħ è¯»
çļĦç ľ
èģĶ ç³»
è¯´ æĺİ
çĶŁ éķ¿
èĩª åĬ¨
åªĴ ä½ĵ
æĬ Ĺ
åĪĽ æĸ°
ç§ ģ
n um
Ġ è¿Ļ
æŃĮ æĽ²
èĢĮ ä¸Ķ
çŃĸ çķ¥
å°Ĩ åħ¶
éģ Ĺ
çģ ¯
å®ļ ä¹ī
è´ ¥
åĲ ¯
èĥ ¡
æī ĺ
éĿ ł
åĮº åŁŁ
åľ Ĩ
èĳĹ åĲį
éĢ Ķ
ãĢĤ âĢĿ
Ġ is
é¤Ĳ åİħ
éĺ ¶
å¾ Ħ
ç§ Ģ
ä¹ĭ åīį
è¾ Ĩ
åı¦ å¤ĸ
å¢ŀ å¼º
éĩĩ åıĸ
Ġ W
ä¸Ģ èĪ¬
ä¹ ħ
çħ ®
k e
Ġ st
è¿ĺ æĺ¯
æĲŃ éħį
çĽ® åīį
o d
èī¯ å¥½çļĦ
ä½ł åı¯ä»¥
è¿ Ķ
æīĭ æľº
å± ĭ
ç»ĥ ä¹ł
ä¼ ¯
å½ĵ æĹ¶
åı£ æĦŁ
æĭ Ł
å¿« éĢŁ
å¤ļ ç§į
æ° ı
æ·· åĲĪ
å·¥ ç¨ĭ
æĪĲ æľ¬
æĥħ ç»ª
åħ´ è¶£
å® ¡
åĳĬè¯ī æĪĳ
æĭ ¿
p rint
è´ §
éĿ¢ çļĦ
åŃ¦ æł¡
åĶ ±
åĮ Ģ
èĥĮ æĻ¯
é¥® é£Ł
æĦŁ è§ī
æ·» åĬł
at e
å¹³ åı°
æ¶ ī
i r
åĽ º
Ġ l
èĢħ çļĦ
åį³ åı¯
ä¼ ĳ
a v
å¤ļ å°ĳ
æľī ä¸Ģ
èģ ļ
å¼ ¹
é«ĺ åº¦
ç¨ İ
6 0
æĢ İ
æĥħåĨµ ä¸ĭ
2 4
é² ģ
æı ¡
Ġ F
f or
ï¼ī ãĢģ
åĵ ¥
æĸ¹ åĲĳ
è¶ ĭ
Ġ å°Ĩ
å¹³ è¡¡
Ġ è¯·
è®¡ç®Ĺ æľº
çĶ °
æĬ ĺ
ç©º æ°Ķ
å¦Ĥ ä¸ĭ
éĢ Ģ
æļ ´
æĪĲ éķ¿
ä»¥ ä¾¿
å¸Ĥ éķĩ
ä¿ĥ è¿Ľ
è· Ł
å¹¶ åľ¨
æľī è¶£
éĢĲ æ¸Ĳ
åĩĨ ç¡®
ç³» åĪĹ
è¿Ļ éĩĮ
è®° å½ķ
¹ ģ
ç»ı åİĨ
åĬ© äºİ
èĥ½ æºĲ
æĦŁ åıĹ
æĿ Ģ
çļĦ å¤§
å® Ļ
çŃī æĸ¹éĿ¢
19 4
æ¸ħ æ´ģ
åĨ ł
å¥ ı
æĢ» ç»ĵ
èĲ¥ åħ»
åİĭ åĬĽ
å°ı æĹ¶
ç«ŀ äºī
æ¡ ¥
è¾¾ åĪ°
åľº æĻ¯
å® ½
åķĨ ä¸ļ
è¯ ¾
ä¾ §
å®¶ åħ·
è¡Į çļĦ
é© ¶
å· Ŀ
å®ļ æľŁ
åĮĸ çļĦ
åĬª åĬĽ
è¾ ĸ
çĽ¸ å¯¹
çī© çĲĨ
å° ģ
æĺ¯ ä»Ģä¹Ī
çİ ī
åĮ» çĶŁ
çĸ ¾
åĲĪ éĢĤ
è½ ½
åĳ Ī
at ion
Ċ Ġ
æĦı è¯Ĩ
19 7
çĸ ĳ
å®ĩ å®Ļ
å° º
Ġ 7
è¿Ļ ä¸Ģ
æŃ£ åľ¨
çļĦç Ł
æĸ Ĺ
ur n
åŁ ĥ
æľ Ĺ
éĢĤ éĩı
æĪĲ ç«ĭ
çļ ĩ
å°ı æĺİ
æķ° åŃ¦
æ°´ å¹³
ä¸º æĤ¨
æİ Ī
å¸ Ń
çļĦç ¤
åĲĪ çĲĨ
æ±¡ æŁĵ
ä¸ Ŀ
çļĦç¬ ¬
ä¸ĭ æĿ¥
Ġ G
èĶ ¬
çļĦç Ī
æī ©
éĤ ®
) :
è¿ ª
åģļ åĩº
çļĦ æĸ¹æ³ķ
æ¹ ¿
æĿ¥ è¶Ĭ
æĽ´ å¥½çļĦ
ç¬¬ ä¸ī
ic e
Ġ r
éº ¦
ĠĠĠĠ Ġ
å¤ ®
è· ĳ
åŃĹç¬¦ ä¸²
èĪ ¹
è¶Ĭ æĿ¥è¶Ĭ
åľ¨ è¿Ļä¸ª
æİ¥ åıĹ
åħ¬ åħ±
è°ĥ æŁ¥
æ¨¡ å¼ı
Ġ R
å® ģ
éĢĤ åºĶ
er s
åĵª äºĽ
çŃ ¾
æ¶ ¦
æ½ ľ
å¢ Ļ
æľī åĬ©äºİ
èĳ ±
éĶĻ è¯¯
å³ °
å¤ļ ä¸ª
åįķ ä½į
è´Ł è´£
éļ Ĳ
çĽ Ł
çľĭ åĪ°
ä¸Ģ å®ļ
Ġ [
æµ ĵ
è¶ĭ åĬ¿
ä¸Ģ ä½į
ä¿Ŀ è¯ģ
çĬ¶ æĢģ
åĿ ı
è® ¢
J o
æī§ è¡Į
è¯Ĺ æŃĮ
æ³¨ éĩį
æ³ °
ä¸į åı¯
è½¦ ç«Ļ
æĶ¶ åħ¥
æ± ¤
æĭħ ä»»
éĴĪ å¯¹
çĽ´ æİ¥
ç½ ª
è´¢ åĬ¡
ä¼ļ è®®
æĳ ©
å® «
å ´
ĊĠĠĠĠĠĠĠĠ ĠĠĠ
æĤ¨ åı¯ä»¥
æĥ ¯
Ġ /
æĦı å¤§åĪ©
åĿ Ĳ
æ¬¢ è¿İ
åį ±
2 8
åĬ ³
è¶³ å¤Ł
èĶ¬ èıľ
e x
ç ¹ģ
æĮ ¥
è½¯ ä»¶
æĭ Į
Ġ #
å¦Ĥæŀľ æĤ¨
ç®Ģåįķ çļĦ
A I
éĢĤ å½ĵ
åº¦ åĴĮ
åĲĮæĹ¶ ä¹Ł
èĤ Į
o p
èĻ ļ
è¡Į ä¸ļ
æĤ £
éĺ³ åħī
ä¸Ĭ æµ·
æŁ Ķ
ä¸Ń å¤®
æĺ¯ çĶ±
å» ¶
æĹ ĭ
çĽ´ åĪ°
è· ³
æ¯ Ĵ
æıĲ åįĩ
ç¼ĸ åĨĻ
æĥ³ è¦ģ
t urn
è¡¨ éĿ¢
ä¸ĭ éĿ¢
Ġ x
è¿ĺ åı¯ä»¥
çĬ ¯
çĽ¸ äºĴ
ç« ¥
æĽ ¼
çĹ ĩ
Ġ1 0
åł ¡
éľ ²
äº« åıĹ
èĤ ¥
åĪĨ å¸ĥ
am e
é¡ ¶
åĬĽ éĩı
" ,
a b
ãĢĭ ãĢģ
æľī äºĽ
è°¢ è°¢
äº Ī
è´Ń çī©
æĶ¾ åħ¥
é ½
ç»´ æĬ¤
éĻį ä½İ
è®¾ ç½®
å£ ¤
-- -
2 1
å¹´ ä»£
çŃĶ æ¡Ī
æģ Ĵ
æİĴ åºı
æĸ° éĹ»
åĲİ çļĦ
ä¼ ´
èĦ ļ
çĪ± æĥħ
è´£ ä»»
çĥ §
å¸ ģ
éĵ ¾
çļĦç ĥ
æĹħ è¡Į
ç± į
ç³ ķ
è®© æĪĳä»¬
é¾ Ħ
æĹ §
åħ¶ æ¬¡
æĽ ¿
é¢Ĩ å¯¼
åģ ı
æĶ¿ çŃĸ
Ġ 9
æ³ ¡
è´ ¡
Ġ <
ä¸Ģ æ®µ
ç»ı è¿ĩ
æ² ī
èĢ Ĳ
å± Ĭ
Ġ E
ç» ©
gh t
åı «
å¯¹ æĸ¹
åĿ ¦
åħ± åĴĮ
éĩį æĸ°
å±ķ ç¤º
± ä¹Ĳ
çĸ¾ çĹħ
å®Į åħ¨
æĿ¥ èĩª
æķ ĳ
çĲĨ è®º
4 0
é¼ĵ åĬ±
ä¸ ģ
åĨħ éĥ¨
ç»Ĩ èĬĤ
åĲį ä¸º
çĶ¨ çļĦ
æĶ¹ åĸĦ
åıĬ æĹ¶
ä½ł å¥½
è¶³ çĲĥ
æĥ³ æ³ķ
2 3
çī© ä½ĵ
çī© åĵģ
Ġ *
çĸ «
è¡ ¥
Ġd e
èĴ Ļ
ä¼ĺ åĮĸ
Ġre turn
åĪĽ å»º
çĭ¬ ç«ĭ
åĳ¼ åĲ¸
ç¾İ ä¸½
202 1
æĿ °
æĮĩ å¯¼
æľĢ å¤§
è® ¿
è£ħ é¥°
è¯Ħ ä¼°
é¢Ħ ç®Ĺ
åº Ĩ
é»ĳ æ´ŀ
ul t
æĭ į
æ± ĩ
æĶ¾ æĿ¾
å°Ĭ éĩį
åį Ī
æ± ģ
æľĢ é«ĺ
åĿĩ åĮĢ
æĺ ł
äºĭ æĥħ
h n
p ut
èĲ¥ éĶĢ
è¿ŀ æİ¥
åĪĨ äº«
åī Ĥ
èģ Ĭ
åĭ ĩ
åħ¬ åĽŃ
ä¸º ä»Ģä¹Ī
è§Ĥ çĤ¹
éĽ ħ
èĭ± è¯Ń
çļĦç ł
ç¾İ åħĥ
è Ŀ
æĦŁ è°¢
çĶ ļ
åĪĨ ä¸º
ç¤¾ åĮº
åıĸ å¾Ĺ
ç¬¦ åĲĪ
æĺİ ç¡®
æĶ¾ åľ¨
éĺ µ
æĢ§ èĥ½
è¿½ æ±Ĥ
ä¹ł æĥ¯
èī ¾
éĴ ±
ç¨³ å®ļ
å¿ħ è¦ģ
è¿Ľ ä¸ĢæŃ¥
çĳ ŀ
åĶ Ĳ
en d
è° Ī
æ¦Ĥ å¿µ
å° ¾
å® ľ
æľī ä¸Ģä¸ª
æĢĿ æĥ³
çİ° è±¡
Ġ N
ä¹ ³
è§Ħ åĪĻ
æľĢ ä½³
åĪ ĺ
ç½ĳ ç«Ļ
æĢ ¥
çľ ł
èµ ŀ
è ¹
è¿ ·
éĵģ è·¯
åĨ³ çŃĸ
Ġi f
çļĦ æĸ¹å¼ı
æİĮ æı¡
è®¨ è®º
ç»ı åħ¸
è®¾ æĸ½
çĤ ¼
å¾· åĽ½
æ± ł
è ª
åĵ ²
ç»ĵ æĿŁ
æľº æŀĦ
Ġ v
æĪĳ ä¼ļ
èµ ı
åĪĨ åŃĲ
ç¼ ©
æĪ¿ éĹ´
5 00
è®© äºº
å¾ª çİ¯
çģ ¾
ãĢĭãĢģ ãĢĬ
åºĶ çļĦ
Jo hn
è¿Ķ åĽŀ
èį £
æ¯ı ä¸ªäºº
æĪĳ åı¯ä»¥
æ·± åħ¥
2 2
ç»ı å¸¸
é¥ Ń
å¥³ æĢ§
å»º è®¾
äº ¿
ä» ª
åĪ¤ æĸŃ
æıĲä¾Ľ äºĨ
å¥ Ĺ
åľ° æĸ¹
åı¯ æĮģç»Ń
åĬĽ çļĦ
çĬ¶ åĨµ
èĥ½ éĩı
' ,
éĢ Ĵ
å¹¸ ç¦ı
æĹ¥ æľŁ
å¼º è°ĥ
æ» ĳ
æĶ¹ è¿Ľ
ç¢ ³
å¹´ è½»
åº Ħ
o s
æĢİ ä¹Ī
çİ Ľ
æŃ£ å¼ı
. .
å¼ķ èµ·
åŃ¦ éĻ¢
é¢Ħ æµĭ
åºĶ å¯¹
äº ¡
éķ¿ åº¦
é© ¾
çļĦ æĸĩç«ł
9 9
å¡ ĳ
åº Ĭ
åı¯ä»¥ ä½¿çĶ¨
çĩ ĥ
ä»¥ ç¡®ä¿Ŀ
éģ į
å «
Ġp rint
æĹ¶ å°ļ
åĪ¶ éĢł
éĽ ª
åħ±åĴĮ åĽ½
å§Ķåĳĺ ä¼ļ
è¿Ļä¸ª éĹ®é¢ĺ
åĪ º
è ¸
æĬ ½
å®¤ åĨħ
19 5
ä¸Ģ åĲį
æĥ ł
æľī çĿĢ
æĪĺ äºī
ç§ Ł
å¸® æĪĳ
æ¾ ³
çļĦ çĶŁæ´»
çĿ ¡
ç¬ Ķ
ar t
ç» ĺ
ä¸į è¿ĩ
åĲį åŃĹ
éª ¨
ç¬ ĳ
æ° Ľ
çĦ ¦
å®ī è£ħ
æĲ ľ
æľī ä»Ģä¹Ī
çĭ¬çī¹ çļĦ
åŀ ĥ
æĭ Ķ
åľ ¾
åŀĥ åľ¾
ç¼ĸ ç¨ĭ
ä¹Ł ä¼ļ
éľ ĩ
ä¼ ½
åĲĪéĢĤ çļĦ
è½ ¨
ä¸¥ éĩį
çļĦ å°ı
å¤ļ æł·
n d
Ġb e
çĿ £
æ¶ī åıĬ
éģ µ
èĥ ŀ
èģĶ ç½ĳ
ãĢĭ ï¼Į
âĢĶ âĢĶ
çĶ ľ
çĽ¸ åĲĮ
éĻ¤ äºĨ
æĹ¥ å¸¸
æĲ ħ
æĹł è®º
2 7
ä»Ĭ å¤©
åŃĹ æ¯į
åĽ° éļ¾
è§£åĨ³ æĸ¹æ¡Ī
ä¸Ģ ç¯ĩ
ex t
çļĦåľ° æĸ¹
è¾ £
è¯ ļ
åį ·
l y
å¹³æĸ¹ åħ¬éĩĮ
æµ· æ´ĭ
èĭ± æĸĩ
èĽĭ ç³ķ
æļ Ĺ
è§ ¦
çļĦ ä¸»è¦ģ
è¶ħ è¿ĩ
å¹ ķ
å² ¸
çº ½
èİ «
19 6
re s
ä¸ļ åĬ¡
æ² ¿
æģ Ĳ
å¹´ é¾Ħ
æ°§ åĮĸ
çļĦ ä¿¡æģ¯
ç¾İ é£Ł
æ¯ ķ
å° ¤
ä¸Ń æľĢ
åĢ ¾
æĺ¾ ç¤º
æĭ Ľ
åģ¥ èº«
8 0
çļĦ åºĶçĶ¨
åĵģ è´¨
a in
è§Ħ å®ļ
èĪ °
è¿Ļ æ®µ
ãĢį ï¼Į
è ķ
è° ·
2 6
æĶ¯ ä»ĺ
éĽ Ħ
éľĢè¦ģ æ³¨æĦı
éĿ¢ å¯¹
æ¸ħ æĻ
åĢ Ł
å¢ŀ éķ¿
è´¹ çĶ¨
åīį å¾Ģ
åĲİ æĿ¥
èĴ ľ
Ġ= =
é¢ Ĺ
èĢ ³
éŃ Ķ
i th
è° ±
è´¡ çĮ®
æ¬§ æ´²
æĲħ æĭĮ
ä¹Ł æľī
u b
è¯ Ĭ
çĶļ èĩ³
æŃ£ç¡® çļĦ
å¹¶ ä¸į
çĶ ³
åı¯ä»¥ è®©
æķ ¬
åİ Ĥ
å½ ¼
çļĦç ģ
èĴ Ĥ
æĥ Ĭ
è§Ĥ å¯Ł
an t
20 19
çĽ¸ ä¿¡
çī© ç§į
éķ¿ æľŁ
èĻ «
ä¹ Į
ä¸Ģ é¦ĸ
äºĴ åĬ¨
å¯Ĩ åº¦
ç§» åĬ¨
æ¯ı å¤©
æľºåĻ¨ äºº
ç»¿ èī²
æĸ¹ ä¾¿
20 20
æµģ è¡Į
æİ¨ å¹¿
éĶ »
çĪ Ĩ
ç¥ ĸ
èª ī
çļĦç¤ ¾
è ļ
èį ·
å½¢ è±¡
ä¹ İ
å¹ »
åĴĮ åħ¶ä»ĸ
åıĳ å¸ĥ
æŁĲ äºĽ
æ¶Īè´¹ èĢħ
åĳ¨ åĽ´
èĭ ¥
å¥¹ çļĦ
çľŁ æŃ£
èĬĤ çĽ®
é ³
è½¬ æį¢
å®ī æİĴ
åĩº äºĨ
éĶ» çĤ¼
å¼ Ĺ
å¯ ¸
2 9
çļĦç ©
åĩº æĿ¥
é¸¡ èĽĭ
å®£ ä¼ł
åħ¨ åĽ½
åħħ åĪĨ
çĶŁæĪĲ ä¸Ģä¸ª
è½¦ è¾Ĩ
åĬ¨ ä½ľ
ç¨ĭ åº¦
å°Ĩ ä¼ļ
åı£ åĳ³
æ¢ ħ
çļĦ æķ°æį®
æĢ Ģ
h i
å¹¿ åĳĬ
é£Ł æĿĲ
ä¸ ¹
è§ī å¾Ĺ
ou t
æ°ĶåĢĻ åıĺåĮĸ
é ŀ
ľ ä¼½
éģ Ń
æµģ ç¨ĭ
èĦ ±
on e
åĪ ļ
åĵ² åŃ¦
é» İ
äºº çĶŁ
çĽ Ľ
è¯Ĩ åĪ«
å¿ Ĩ
åŃ¦ ä¼ļ
19 3
ĠĠĠĠ ĠĠ
éĩĳ èŀį
çīĽ å¥¶
å¸¸è§ģ çļĦ
q u
åŃĲ çļĦ
ou r
å¤§ å°ı
è®© æĪĳ
éĺ¶ æ®µ
å¤§ éĩı
çİ° å®ŀ
å·¦ åı³
æķ ı
éĻĲ åĪ¶
ä¸Ń æĸĩ
ç»Ĩ èĥŀ
æĪĲä¸º äºĨ
ç¡ ¬
å² ©
æ°´ æŀľ
æĶ» åĩ»
åº Ł
æ® Ĭ
ä¼ĺ ç§Ģ
åĨħ çļĦ
Ġ Ã
æĹ¶ ä»£
å® ¾
å±ħ æ°ĳ
åıĮ æĸ¹
ç²¾ ç¥ŀ
ä»ĸ åľ¨
ç»ĵ åĲĪ
åį« çĶŁ
ä¸Ĭ éĿ¢
ä¼ĺ åĬ¿
è¯Ħ ä»·
åı¤ ä»£
èĮ Ħ
åĩº çļĦ
æ³ ³
è£ħ ä¿®
ä¼ĺ çĤ¹
ç±» ä¼¼
é» ĺ
é«ĺ æķĪ
è§Ĥ ä¼Ĺ
åŃ£ èĬĤ
åĪĽ æĦı
çı į
ä¸į éĶĻ
p ython
åºĶçĶ¨ ç¨ĭåºı
çļĦçł Ķ
å¤§ å®¶
èı ²
èī² å½©
å© ´
å®¶ å±ħ
æģ ¶
å¯ ¿
éħĴ åºĹ
åŃ ¤
æıĲ åıĸ
e w
i v
èĽĭ çĻ½
æ·± åĪ»
åİ ļ
åĺ ī
çª Ĺ
è· µ
ç¾İ åĳ³
æĥħ èĬĤ
çĽ¸ ä¼¼
ä½ĵ çļĦ
é¥ ¼
å·¥ ä¸ļ
åĨĻä¸Ģç¯ĩ åħ³äºİ
å¹ ħ
çļĦæĹ¶ åĢĻ
éĥ¨ éĹ¨
æĦ ī
ç½ ²
èĦ Ĥ
ä»į çĦ¶
é¦ Ī
r ac
å°¼ äºļ
æĪĲ åĪĨ
éĽ ¶
çĽ® çļĦ
ä¸Ģ æł·
åĳĪ çİ°
éģĵ å¾·
éļ Ķ
å¼ ĥ
æİ¨ åĬ¨
çļĦ æĹ¶éĹ´
è¿Ĳ è¡Į
å½¢ çĬ¶
éķ ľ
æł¸ å¿ĥ
åŁ¹ è®Ń
æ¯ «
åį ¢
åĳ³ éģĵ
å°½ ç®¡
for m
ä½ł éľĢè¦ģ
çº¢ èī²
ãĢĭ ï¼Ī
æ» ©
çı ł
æ½ ®
èİ· åıĸ
çļĦ å·¥ä½ľ
ç¥ŀ ç§ĺ
æĢĿ ç»´
p p
åĨ Ĵ
éĤ ¦
Ġ æĺ¯
çĶµ èĦĳ
ar r
åħ± æľī
æ¸ħæĻ °
çķ ª
o b
åį° åº¦
åı¥ è¯Ŀ
ä¸ª æĢ§
ãĢį ãĢĤ
éĩı åŃĲ
ç»Ļ å®ļ
éĢ ĥ
å®ŀ è·µ
èĩ³ å°ĳ
æīĢ éľĢ
éĹ Ń
çī¹ æ®Ĭ
åľ¨ ä¸Ģèµ·
é¡ µ
çļĦ åħ³éĶ®
åįĥ ç±³
ç¥ Ŀ
éĻĦ è¿ĳ
åŃĺ åĤ¨
ãĢĭ ãĢĤ
å¼Ģ æĶ¾
çĤ ¸
çĲĥ éĺŁ
) )
ä¸Ĭ æľĢ
ä¿¡ ä»»
çļĦç ¨
åĨ ¬
ä»¤ äºº
æ»¡ æĦı
éļ Ĩ
è®¤ è¯Ĩ
a g
è¯Ħ è®º
es s
äºĴ èģĶç½ĳ
èľ ľ
éĿ¢ ä¸´
å£° éŁ³
é©¾ é©¶
c i
éº »
æį ·
æĬ «
æį ķ
çļĦç© º
å¯¹è¯Ŀ åĨħå®¹
in d
è¹ Ī
æĦı è§ģ
i g
éĴ ¢
Ġ `
æľī æīĢ
å§ ľ
åĩ ī
æĪ¿ å±ĭ
çļĦ æķħäºĭ
æ· ¡
åıį é¦Ī
ä»¥ä¸ĭæĺ¯ ä¸ĢäºĽ
çļĦ å»ºè®®
åĨł åĨĽ
è¯¾ ç¨ĭ
è¿ĩ åİ»
Ġå½ĵçĦ¶ åı¯ä»¥
å¨ ±ä¹Ĳ
èĳĹåĲį çļĦ
ç§į ç±»
çļĦçĪ ±
Ġ int
æķ° çļĦ
èģĶ åĲĪ
ac k
ä½ł ä»¬
äº¤ æĺĵ
Ġ O
èĳ ¡
è¿Ľ æŃ¥
åĩº çĶŁ
ä½ł èĥ½
èĪŀ è¹Ī
åĨį æ¬¡
éģĵ è·¯
å¯» æ±Ĥ
çĶ¨ æĿ¥
as s
ä¿ Ħ
å¤ı åŃ£
åĦ¿ ç«¥
çļĦ çİ¯å¢ĥ
åıĺ éĩı
éĥ½ ä¼ļ
202 2
äº§åĵģ çļĦ
å®Ŀ å®Ŀ
æĸ¹ ç¨ĭ
æ³ ½
l d
an s
ï¼Į âĢľ
æĿ¥ æºĲ
çĹ Ľ
å·® å¼Ĥ
' s
è¯ģ æį®
o o
å Ĺ
æ¶ Ĥ
ä¾ĭ åŃĲ
ç»Ħ åĲĪ
çļĦçłĶ ç©¶
èĢ Ĺ
N A
åĮ ¹
æĴ °
å¼ Ł
æ¸© æļĸ
æİ¢ è®¨
äººæ°ĳ åħ±åĴĮåĽ½
æĮĩ åįĹ
å¿« ä¹Ĳ
åħ ¼
çĳ ľä¼½
åĿ Ģ
æİ¥ ä¸ĭæĿ¥
è¡¨ æ¼Ķ
çļĦ éľĢæ±Ĥ
ç¾İ çļĦ
20 00
ä¾ µ
è§ Ī
ç»¼ åĲĪ
ç Ĵ
å¤ļ çļĦ
Ġ li
æ£® æŀĹ
Ġ el
åį ĸ
åħ¬ å¼ı
çļĦç ¼
ç¼º çĤ¹
20 10
è¿ ¹
çĶŁæĢģ ç³»ç»Ł
æ°Ľ åĽ´
çĽ¸ åºĶçļĦ
éĢ »
ç» ķ
åŁ¹ åħ»
æ·± åº¦
æĲľ ç´¢
åĶ ¯
æĹ Ĺ
æĦı åĳ³
å®£ å¸ĥ
å¦ »
ä½ľ èĢħ
Ġc h
el f
ä½ĵ èĤ²
æģ ĭ
åľŁ å£¤
al l
åŃ Ļ
åĢĴ åħ¥
åģĩ è®¾
ä» Ķ
p t
èĲ Ħ
çļ® èĤ¤
èĳ¡ èĲĦ
Ġ it
st r
å·§ åħĭ
åĲĪ åĲĮ
ä¸Ńåįİ äººæ°ĳåħ±åĴĮåĽ½
æ® ĸ
æĢ» çļĦ
åĢ¼ å¾Ĺ
èĭ ¦
æİ ī
å¡ «
ç»Ļ å®ļçļĦ
æ ĩ
éĵ¶ è¡Į
çĶŁ åŃĺ
ç¤¾äº¤ åªĴä½ĵ
çļĦ æĥħæĦŁ
æĦŁ åıĹåĪ°
åľ° çĲĨ
éª ĳ
å¯ º
æĿ ¨
æĢ» ç»Ł
éĹ®é¢ĺ çļĦ
201 8
ou nt
æľī å¾Īå¤ļ
çģ °
æ¡ £
* *
èħ ¿
éĢĤå½ĵ çļĦ
è¯ģ æĺİ
7 0
è¯» èĢħ
åı¦ ä¸Ģ
åıĤ èĢĥ
å¼ ±
å§ ¿
å¤ªéĺ³ ç³»
éĨ Ĵ
æ¡ Į
å±ķ çİ°
ar d
çī¹ èī²
è¶³å¤Ł çļĦ
åı¯ä»¥ éĢīæĭ©
å¦ Ĩ
æĺ¯ ä¸ŃåĽ½
âĢ ĭ
åıĹ æ¬¢è¿İ
a ge
åįģ åĪĨ
åī ª
é½ Ĳ
åĨ Į
ä» °
åİŁ çĲĨ
ä¹ ı
å± ı
a k
è®² è¿°
è® ¯
æľī æĹ¶
ç ¦ģ
æ¬ £
4 5
èĴ ¸
æı ´
a x
éŁ ©
æī ¬
çĨ Ĭ
çļĦç ²
æīĢ è¿°
åİ ¨
æĶ¶ éĽĨ
ç»¼ ä¸Ĭ
æ°ĳ åĽ½
å½ ¹
Ġ J
éŀ ĭ
åĪĩ æĪĲ
æ°Ķ æ¸©
æĢ»çļĦ æĿ¥è¯´
èµ ĸ
ä¸ĭ çļĦ
p ort
æľºåĻ¨ åŃ¦ä¹ł
åŃ¦ èĢħ
èĩª ä¿¡
ä¸ī è§Ĵ
æ£ Ĵ
æĸ¯ çī¹
æµ· æĭĶ
å½ĵ åīį
å¤§ éĩıçļĦ
è§Ĵ åº¦
è¡¨ æĺİ
ä¸º ä¸»
è§Ħ æ¨¡
ç¿ °
éľĢè¦ģ èĢĥèĻĳ
èı Į
Ġ æł¹æį®
åĮ» åŃ¦
æĬ µ
________ ________
é£ŀ è¡Į
ä» ģ
è¿ĩ åº¦
èĤ ¯
åı¦ ä¸Ģä¸ª
it y
ä¹ Ļ
å¤§ éĻĨ
è¿ ģ
Ġth at
è¿ Ŀ
è´Ł éĿ¢
ç´ «
ä¸Ģ æ¬¾
Ġ å¦Ĥæŀľ
p l
Ġ on
ä»ĸ äºº
åĨĻ ä½ľ
Ġc on
Ġ çļĦ
åĿļ æĮģ
å§ ĵ
Ġ le
åĴ ¨
an ge
çļĦç ĭ
æĪ ´
âĢĭ âĢĭ
åħ·ä½ĵ çļĦ
é© »
èģ ĺ
Ġ j
9 0
ç±»åŀĭ çļĦ
æĦıåĳ³ çĿĢ
æĢģ åº¦
èħ Ĳ
åĮĹ éĥ¨
éĥ ģ
æĸ° é²ľ
éĥ ¡
ä¿Ŀ éļľ
3 1
æı Ĵ
ï¼ī ï¼ļ
æ³ķ éĻ¢
p er
æķ Į
æŀ ª
æĻ ĭ
çķ ħ
è£ ģ
æ¸¸ æ³³
ç§į æ¤į
è¯· ä½ł
å¦ Ļ
ä¹ ±
å©´ åĦ¿
å¿ ł
åı¯èĥ½ æĺ¯
p e
å©ļ ç¤¼
èĩª è¡Į
éĢ» è¾ĳ
æľī éĻĲ
è¢« ç§°ä¸º
è¿Ĳ ç®Ĺ
ç² Ĵ
è ¦
åĪ ĳ
å£ ģ
è®º æĸĩ
æ¼Ķ åĳĺ
æĭ ¼
çĶŁ å¹³
è¿Ļ ç¯ĩ
3 5
de f
æĪĳä»¬ åºĶè¯¥
çĪ¶ æ¯į
ç»Ł è®¡
åıĬ åħ¶
åĬŀ åħ¬
åĴ¨ è¯¢
åĩ ¯
æĽ¾ ç»ı
ä¸°å¯Į çļĦ
å½¼ æŃ¤
åıĺ æĪĲ
å¾Ī å¥½
Ġ }
éĢī é¡¹
å·§åħĭ åĬĽ
çĶŁæ´» ä¸Ń
çļĦä¸Ģ ç§į
çļĦç ½
æĹ¶éĹ´ åĴĮ
ä¸¾ è¡Į
åĲĮ æł·
éĺ »
éĤ® ä»¶
éģĩ åĪ°
å®ŀ æĸ½
åĩº çīĪ
æ¯ķ ä¸ļ
åĪĹ åĩº
æŃ£ å¸¸
çĲ ´
i a
å¿ ĺ
æĬĢæľ¯ çļĦ
å¤§ æ°Ķ
éĤ£ äºĽ
åįĹ éĥ¨
è½» æĿ¾
çĵ ľ
i z
èµ ¢
ul a
åıª æĺ¯
ä¼ ¸
äºĭ é¡¹
é¢ĺ çĽ®
æľ µ
èµĦ äº§
çļĦ è®¾è®¡
åĪĨ éħį
å¯¹ è±¡
è¥¿ çıŃ
æµ ®
ç»¼ä¸Ĭ æīĢè¿°
è¥¿çıŃ çīĻ
çģ Ń
201 6
éĩĳ å±ŀ
ç¦» å¼Ģ
è¦ Ĩ
ä¿Ŀ éĻ©
ç¢ İ
ä¸¤ ç§į
æīĢ åľ¨
å°¤ åħ¶
ç¬¬ ä¸Ģä¸ª
èĵĿ èī²
åħī çº¿
ä¹ Ķ
è· ¨
çĲĥ åĳĺ
æĻ¯ çĤ¹
åŃ©åŃĲ çļĦ
il l
çŃī äºİ
æľīæķĪ çļĦ
å¿ħè¦ģ çļĦ
Ġw ith
çļĦä¸Ģ éĥ¨åĪĨ
åŁº åĽł
èĦ ī
åĲ ´
æħ §
ä¸Ģ åıª
åıĳ æĮ¥
é¥® æĸĻ
åĢ º
æ¢ ģ
èµ «
åľ° çļĦ
èĩª èº«
in e
æ¯Ķ ä¾ĭ
æĪĳä»¬ å°Ĩ
åľ¨ çº¿
è¢ ĭ
å§ »
éĺ² æŃ¢
åľ¨ ä¸Ģä¸ª
æģĴ æĺŁ
èĬ Ŀ
éĺ ´
å¦ Ī
æķ ¦
å°½ åı¯èĥ½
i st
å¸ ķ
èµĦ æĸĻ
çļĦ åŁºç¡Ģ
' :
äººç±» çļĦ
åķ Ĭ
è¾ ħ
æİ¨ çĲĨ
æ°Ķ ä½ĵ
å¼º çĥĪ
æ¡Ī ä»¶
åľ Ī
é»Ħ èī²
èİ ī
åĪ Ģ
è§Ĩ è§ī
å¹¶ å°Ĩ
çĵ ¶
å¤ļ æķ°
çļĦç ¥
ä¿® æĶ¹
çĥ ¹
om e
äºĭ å®ŀ
t r
çļĦçĥ Ń
åĸľæ¬¢ çļĦ
çĽ¸åħ³ çļĦ
æĦı æĢĿ
= "
éĩį å¤į
Ġre s
an g
T he
æĬ« èĲ¨
ä¸ľ è¥¿
ä»·åĢ¼ è§Ĥ
éĢī ä¸¾
Ġ \
é ī
å® ĭ
ç»´ æĮģ
å½¢ çļĦ
çº½ çº¦
çĥ Ł
çĦ¦ èĻĳ
è·¯ çº¿
æĹ ¢
è´ ¦
201 7
åįļ çī©
çŁ ¿
åŃ Ķ
æĤ¨ éľĢè¦ģ
éī ´
T om
æĺ¯ éĿŀå¸¸
Ċ ĠĠ
æĪĲ ç»©
av a
éļı æľº
å©ļ å§»
åĲĦ ä¸ª
é¥ ª
m ent
æĶ¯ åĩº
éķ¿ çļĦ
å®¶ äºº
æķ´ æķ°
æľªæĿ¥ çļĦ
æĺŁ æľŁ
æľī çļĦ
çī© çļĦ
æİĴ æĶ¾
èľ Ĥ
è± ª
ç¼ĵ è§£
æĸ¹éĿ¢ çļĦ
åĪĻ æĺ¯
u c
åħ ¹
å½ĵ çĦ¶
äºº å£«
äºº éĻħ
èĢĮ ä¸įæĺ¯
è°ĥ åĳ³
åı¯ä»¥ æł¹æį®
âĢ ¦
å¸¦æĿ¥ äºĨ
åŃ¦ åĲį
åĲĮ å¹´
â Ħ
æĤ£ èĢħ
åıĤ æķ°
åİ ĺ
æ² ĥ
éĻ ·
ap p
åĪĹ è½¦
åĨħ å¿ĥ
æī °
Ġ âĢľ
C h
i e
æķ° ç»Ħ
æģ ¢
201 1
çķª èĮĦ
æľīè¶£ çļĦ
åĪ© æ¶¦
èģĶ çĽŁ
åĵª ä¸ª
or e
åıĳ è¡Į
å®Į æķ´
æľ ±
è®¾ æľī
å¤ º
ç±» åĪ«
ç¼º ä¹ı
éĽĨ ä¸Ń
è¿Ļ æĺ¯ä¸Ģä¸ª
éĿ¢ åĮħ
Ġp ro
çĤ İ
åľ¨ äºİ
èĽĭçĻ½ è´¨
çº ·
è¿ĲåĬ¨ åĳĺ
ç¾İä¸½ çļĦ
ç»Ļ äºĪ
åĴĮ æĸĩåĮĸ
éĶĢåĶ® é¢Ŀ
è¯Ń éŁ³
âĦ ĥ
æ¸ħ åįķ
è¯Ń æ³ķ
é¡¾ å®¢
ä½ ©
åĲ« æľī
çļĦ æ°´
æķ´ ä½ĵ
é¼ ł
å¤ı å¤©
u re
ä¸į è¶³
ç¯ ®
åĨ² çªģ
æĢ» æĺ¯
å¼ķ åĬĽ
æľº åĪ¶
è½¨ éģĵ
éļĲ ç§ģ
ä» ¿
ï¼ļ "
ä¹ĭ å¤ĸ
çº ¹
èĸ Ħ
ä¸ĵ è¾ĳ
Ġ lo
3 6
æ´ ª
éĤ »
éļı æĹ¶
æĢ§ è´¨
201 5
åĢ į
å¢ ¨
çļĦ ä¸»
å¹³æĸ¹ åįĥç±³
æĹ ¨
èĬ ¬
çļĦ åĨħå®¹
äºĴ çĽ¸
æ¼Ķ è®²
è¢« è®¤ä¸º
çº ¯
èıľ åĵģ
å®¶ æĹı
å¾ Ĵ
æĽ´ æĸ°
ç¾İ å¥½çļĦ
äºĮ åįģ
è¯· è¾ĵåħ¥
åĪ° è¾¾
er e
å®Ĺ æķĻ
æĤ ¦
ç»ĵ è®º
æłĩ å¿Ĺ
åĩı è½»
å¤© ç©º
æĺİ æĺ¾
åº Ļ
è´ ´
èº« ä»½
) ;
éĿ¢ç§¯ ä¸º
æģ¢ å¤į
æ» ¤
ç¿»è¯ĳ æĪĲ
ç§ĳåŃ¦ å®¶
æ¶ µ
Ġ ---
è¯ ¸
åģ ¶
çĻ½ èī²
< /
å¤§ çº¦
åı¯ éĿł
çļĦ è¯Ŀ
å¤§ åŀĭ
201 2
z h
å¯Ĩ çłģ
é¢Ħ éĺ²
åįļçī© é¦Ĩ
æ° ¢
âĢĿ ãĢģ
ç¼ĸåĨĻ ä¸Ģä¸ª
è¯Ń åı¥
çľĭ èµ·æĿ¥
äºİ æĺ¯
éĿ© åĳ½
éļ¾ ä»¥
æº ª
t e
æĪĺ æĸĹ
çļĦ åŁºæľ¬
Ġ ãĢĬ
èģĶ èµĽ
é£Ł çĶ¨
åĽ½ æ°ĳ
åĮ» éĻ¢
åĬł ä¸Ĭ
æľĢ å¤§çļĦ
æĿ ľ
éĩį éĩı
å¤ª ç©º
ä¸Ģ å¹´
w ord
æĭ ľ
201 4
å£ ®
çļĦ ä¸»é¢ĺ
é¡º åºı
ç¬¬ åĽĽ
æĴ Ĵ
çī©çĲĨ åŃ¦
å¦Ĥ æŃ¤
çī¹ å®ļ
æĮĩ åĩº
æĽ´ æį¢
æĪ ª
æµĭ éĩı
èĭ ¹
åħħ è¶³
201 3
å¤ĸ è§Ĥ
åĮ Ļ
å¨ ľ
Ġ V
ç« ¹
åŃ¦ä¹ł åĴĮ
åĸ Ŀ
è¿ĺ éľĢè¦ģ
ç½Ĺ æĸ¯
çº¦ ç¿°
äºº åľ¨
ç¼ĸ çłģ
åĽŀçŃĶ éĹ®é¢ĺ
è®¤ çŁ¥
éĽĨ åĽ¢
åĿ ¡
è¿ ħ
è´ ¾
èĤ¡ ç¥¨
æĬ¥ éģĵ
éĿ¢ è¯ķ
åħ· å¤ĩ
çł´ åĿı
u d
å¤± åİ»
èī¯ å¥½
3 3
éĿ¢ ä¸Ĭ
çĶ· åŃĲ
æĭ ĵ
èĥ ģ
çĪ µ
èĭ¹ æŀľ
èĢĮ æĺ¯
åº¦ çļĦ
å¦ ĩ
å®ĥ æĺ¯
i ve
æĳ Ĩ
è£ Ĥ
åĪ© äºļ
èĪª ç©º
çĮ ª
çļĦ è¿ĩç¨ĭ
æŁ¥ è¯¢
èį¯ çī©
å·¨ å¤§çļĦ
åľ¨ å®¶
è¿ «
çļĦ åİĨåı²
èµĦ éĩĳ
ä¸Ģ å®ļçļĦ
åľ° çĤ¹
èĻļ æĭŁ
åĬ¨ åĬĽ
å·´ é»İ
ç»ı èĲ¥
åĨľ ä¸ļ
ç¥ŀ ç»ı
å¾ ¡
Ġ 20
åįı è®®
% ãĢĤ
å°ı çļĦ
o c
f t
èĤĮ èĤī
ct ion
ç´ ¯
ç¡® è®¤
æ´ ¥
ä¹¦ ç±į
åĴĮ è°
a re
èĢĮ è¨Ģ
è¡£ æľį
çīĪ æľ¬
åį± éĻ©
ä¸İ åħ¶ä»ĸ
è¯Ĭ æĸŃ
ç½Ĺ é©¬
æ¶ ¯
å» ·
ä»¥ä¸ĭ åĩłä¸ª
æĤ ¬
çļĦçŁ ¥
b er
çľŁ å®ŀ
åĴĮ ç¤¾ä¼ļ
ä½¿çĶ¨ çļĦ
æ¨¡ æĭŁ
" ï¼ī
èĬĤ å¥ı
çļĦ éĢīæĭ©
éĿŀå¸¸ éĩįè¦ģ
äºĨ ä¸ĢäºĽ
ä» Ļ
çļĦ æĥħåĨµ
æĮ Ĥ
æľº åľº
çļĦç Ĭ
æļ Ĥ
æ¸ ł
200 9
è¯¦ç»Ĩ çļĦ
æŃ» äº¡
ä¸ĭ è¾ĸ
è¢ Ń
åī ©
ä¼ Ł
ä¼ł æĴŃ
èĢģ å¸Ī
çļĦ æĸ°
ç¢ į
å¨ģ èĥģ
u st
éĩį çĤ¹
åĪ ·
èİ İ
çĪ± å¥½
Ġ éĿŀå¸¸
å¯¹ æīĭ
åįı è°ĥ
åĲ¸ æĶ¶
æ¡ Ĩ
æ ª
å°± ä¼ļ
åıĺå¾Ĺ æĽ´åĬł
in put
è¥¿ äºļ
200 8
Ġt r
âĢĿãĢģ âĢľ
ä»¥ æĿ¥
åıĳ è¡¨
Ġ K
åľŁ åľ°
æł ĸ
è§£åĨ³ éĹ®é¢ĺ
ä¼ĳ æģ¯
li st
è¿Ĳ çĶ¨
åİŁ åŃĲ
æīĢæľī çļĦ
å¿ Ļ
æĪĲ å°±
ä¸Ń åħ±
æĻ® éĢļ
éĩĮ çļĦ
åĶ¯ ä¸Ģ
éľ į
åŃ¤ çĭ¬
çļĦ å®īåħ¨
Ã ©
åĳ¨ æľŁ
Ġw e
æľĢ å¥½
é£ŀ æľº
Ġ ç»ĻæĪĳ
çĶµ è¯Ŀ
ä»Ģä¹Ī æĺ¯
A l
é»ĳ èī²
å¿ĥ åĴĮ
ç£ ģ
æĻļ ä¸Ĭ
ç¼ ĺ
ç£ ¨
å¹¶ æıĲä¾Ľ
åĨĽ äºĭ
åĨĻä¸Ģ ä»½
æ© Ļ
ä¿¡ ä»°
çļĦ ä½¿çĶ¨
çļĦ é¢ľèī²
Ġ ä½¿çĶ¨
çºª å¿µ
èĢ ¶
çļĦ è´¨éĩı
å· ¡
å¸¸ å¸¸
é¦ĸ æ¬¡
åĴĮ åıĳå±ķ
å¾Ģ å¾Ģ
æĻº æħ§
Ġe x
æ¢¦ æĥ³
æ°ĳ ä¸»
è°ĥ èĬĤ
ä½¿ åħ¶
çļĦç² ¾
7 5
è¸ ª
çĽ ¾
æķĻ æİĪ
çļĦ éŁ³ä¹Ĳ
åĵģ ç§į
ç®Ģ æ´ģ
å¹¶ æ²¡æľī
ä¿ Ĺ
éĺ Ĳ
æŀĦ æĪĲ
æī ®
å°± åı¯ä»¥
çĿ¡ çľł
å¯ Ĵ
åħ¬ è·¯
çĬ ¬
æľī æľº
è®¿ éĹ®
Ġ ä¸į
Ġa re
æĴ ¤
f f
Ġ1 00
å°½ éĩı
} -
éĶ ¦
éĩĬ æĶ¾
çİ »
çŁ¥ åĲį
éĺ¿ å°Ķ
å¾Ĺ åĪ°äºĨ
èĮ ¨
ac e
å¥ ĭ
x x
éĵ ľ
éĵ º
çŁ ©
ç§¯æŀģ çļĦ
æĽ´ ä¸º
im e
çļĦ ä½įç½®
éĹ ª
æ³ ¥
è¦ģ æ³¨æĦı
å»º éĢł
è¾ĥ ä¸º
æīĵ å¼Ģ
æµª æ¼«
æ£ ĭ
çļĦéĩįè¦ģ æĢ§
æĳ ĩ
åĪ¶ åº¦
åį³ ä½¿
at a
ä¼ĺ æĥł
åĲ¬ èµ·æĿ¥
è§Ħ èĮĥ
å¹ ¼
Ġ ä½ľä¸º
è ²
19 0
4 8
æİ¨ åĩº
çĶµ æ±ł
çĥ¹ é¥ª
å¤Ħ äºİ
éļ ¶
ä¸¾ åĬŀ
éĢ Ĭ
æ¯ ģ
en ce
æįŁ å¤±
æİĴ åĪĹ
ç¾ Ĭ
Ġc om
å±ħ ä½ı
ç¤º ä¾ĭ
ä¼ł éĢĴ
æĢ§ æł¼
é© ±
ä¼ į
éĶħ ä¸Ń
Ġw h
i ght
æĺ¯ä¸Ģ ä½į
çĶŁ ç´ł
æĦŁ åĴĮ
äººä»¬ çļĦ
æīĭ æ®µ
ä»¥ä¸ĭ æĺ¯ä¸Ģä¸ª
el l
è§Ħ å¾ĭ
çĽ Ĩ
æ¯į äº²
æĬķ åħ¥
ç½ ļ
çĥ¤ ç®±
åľ¨ æŃ¤
éĩį è§Ĩ
ç§ Ĵ
Ġm e
Â °
åħĭ æĸ¯
è¦Ĩ çĽĸ
åĵ º
åĽłä¸º å®ĥ
è½» è½»
ç ŀ
è½¬ åĮĸ
ç¢ Ĺ
å¥³ åŃĲ
çĶ³ è¯·
çĶŁ æ¶¯
æķ° ä¸º
èĩªçĦ¶ è¯Ńè¨Ģ
åįģ äºĮ
åľ¨ è¿Ļ
Ġ åĴĮ
è· ĥ
é«ĺ åħ´
æıĲ ç¤º
çĲĨè§£ åĴĮ
çļĦ äº§åĵģ
è§Ĩ ä¸º
æĶ¾ ç½®
m a
Ġ éĤ£
ä¸Ĭ è¿°
å® ¿
æ³ ī
æ°§ æ°Ķ
æ¥ ļ
åį §
èĥ¡ æ¤Ĵ
äººå·¥æĻºèĥ½ æĬĢæľ¯
èµ¢ å¾Ĺ
ä¸Ģä¸ª äºº
åİĺ ç±³
èĻ İ
ä¸Ģ æĿ¡
XX X
Ġ1 2
è´ ·
æ¬£ èµı
Ġa s
æº ¶
çĥŃ å¸¦
çļ Ĩ
æĴ ŀ
è¯į æ±ĩ
çļĦ åħ³ç³»
åĲĪ çī©
è®¾ ç«ĭ
Ġc an
èģĮ åľº
1 000
æ°ĳ æĹı
çļĦçľ Ł
ç¾ ½
èĲ Ŀ
äºļ æ´²
çļĦ åİŁåĽł
æĽ´ å®¹æĺĵ
Ġ an
ç© Ĩ
å®¶ éķ¿
çļĦ ç»ĵæŀľ
ä¸Ģ ç»Ħ
èŃ¦ å¯Ł
- {
æŁĲ ä¸ª
èĭ Ĺ
çļĦç¤¾ ä¼ļ
åĪ© çĽĬ
å®ŀ çĶ¨
æİ¥ è§¦
èĬ± åĽŃ
æĪ· å¤ĸ
åĸ ·
çīĽ èĤī
çĮ İ
å·¥ èīº
ä¸» å¸Ń
æ´ĭ èĳ±
æķ ¢
ä¸» æķĻ
æĸĩ åŃĹ
çļĦ è¡Įä¸º
n e
å¿ ½
å¹´ èĩ³
éŁ ¦
äºĨ è®¸å¤ļ
çļĦ æĢ»
çĶµ åĻ¨
åĴĮ æľįåĬ¡
åľº æīĢ
æł¼ åħ°
æľ¬ ä¹¦
åİŁ åĪĻ
æ¦ Ħ
è¾ Ĳ
ä¸Ģ å®¶
æ°´ ä¸Ń
éĹ ²
æĺ¯ æľĢ
ĠT he
åĴĮè° Ĳ
çĶ ĺ
éĤ Ģ
æĥ³ è±¡
æ¢ °
Ġ Y
åĸľ å¥½
æ¸ł éģĵ
åħ¨ éĿ¢
çĶ· æĢ§
æķĻ åŃ¦
æĬ ±
æī £
% ï¼Į
èĥ½åĬĽ åĴĮ
-------- --------
ï¼Į ï¼īï¼Į
æ°´ åĪĨ
éĽ ķ
æĦŁ æŁĵ
ï¼Į ãĢĬ
ä¹ĭ å¤Ħ
æĹ© æľŁ
æİĴ åĲį
è¿Ļ é¦ĸ
r om
å®¶ çļĦ
åıª èĥ½
åĵº ä¹³
t er
éĢĤ éĩıçļĦ
åĮĸ åĴĮ
t ext
è¿Ĳ èĲ¥
åľ° éľĩ
å¤± è´¥
æ® ¿
èĩªè¡Į è½¦
çļĦ çĽ®æłĩ
åĸ Ĥ
ä¼ļ åľ¨
éĥ İ
ä¸įæĸŃ åľ°
çķĻ ä¸ĭ
åı ¬
äº§ ä¸ļ
è² Į
è¿Ļæł· çļĦ
Ġ or
è¿ĩ äºİ
åĮº çļĦ
D NA
Ġ è¿Ļä¸ª
æ¤ ħ
å®Į åĸĦ
å±ķ å¼Ģ
æŁ ľ
çĴ ĥ
çº¦ ä¸º
æĪĳ è®¤ä¸º
çĪ± çļĦ
æĦŁ æĥħ
æĺ Į
åįı ä½ľ
äººåı£ å¯Ĩåº¦
çŃī æĸ¹å¼ı
æŀ Ŀ
Ġres ult
éĥ¨ çĶµå½±
æµ· åĨĽ
èµ µ
åģ¥åº· çļĦ
å¹² åĩĢ
å¸Ŀ åĽ½
Ġ al
ç¢ ĳ
åĲ Ľ
çĲĨ å¿µ
èİ·å¾Ĺ äºĨ
form ula
æĺ¯ å¤ļå°ĳ
æ® ĭ
} {
çĬ¯ ç½ª
æħ¢ æħ¢
çģµ æ´»
è° ĭ
200 7
è®° å¿Ĩ
è¡ĮæĶ¿ åĮº
Ċ ĉ
éļı åĲİ
3 00
è´ ¸
éĩĳ é¢Ŀ
è¿Ľè¡Į äºĨ
æľīæķĪ åľ°
çĽ¸ å½ĵ
æľį è£ħ
æ© Ħ
æī İ
æĸĩåĮĸ åĴĮ
çĶŁåĳ½ çļĦ
é¸ £
è¯ķ åĽ¾
å°º å¯¸
æĶ¹ ä¸º
æĺ Ĩ
ä¸ĭ éĻį
çĩ ¥
çļĦ çī¹çĤ¹
Ġm y
æ©Ħ æ¦Ħ
åıĳ åĬ¨
æ¸ħ æ´Ĺ
è¾ Ľ
åı¯æĮģç»Ń åıĳå±ķ
çľģ ä»½
a ve
å¹¿ ä¸ľ
ç¼ĸ è¾ĳ
èİ ĵ
è½¬æį¢ ä¸º
å¤įæĿĤ çļĦ
æ» ļ
çĮ ľ
é¸¡ èĤī
ç¾İ å¥½
èµĽ äºĭ
åĪº æ¿Ģ
æĳ ĺ
Ġh e
a st
çģ¾ å®³
è¿Ļ å°Ĩ
çļĦ è¿ĩç¨ĭä¸Ń
è§Ĩ é¢ĳ
åĨĴ éĻ©
æĸ ľ
åľ°çĲĥ çļĦ
éĻ ¶
è¾ ŀ
åī ²
éĢīæĭ© éĢĤåĲĪ
ç»´ çĶŁç´ł
è° ģ
éĥ¨ éĺŁ
çļĦçŁ¥ è¯Ĩ
æĺ Ĥ
åľº åĲĪ
è¿ħ éĢŁ
ä¸Ģ å¤©
èģĬ å¤©
A P
æıĲä¾Ľ ä¸ĢäºĽ
ä¾Ľ åºĶ
éģµ å®Ī
åŁİå¸Ĥ çļĦ
ĠÃ Ĺ
æµ ħ
æ³ķ è§Ħ
Ġ k
å¡ĳ æĸĻ
åİ¨ æĪ¿
çİ° åľº
éĥ ĳ
é¦ ¨
æ¨ ª
åŃ¦ å®¶
æ¯ı æ¬¡
æ· ĭ
ä½ĵ ç³»
è¿Ĳ è¾ĵ
ou nd
åį« æĺŁ
æĸ° åŀĭ
éĿ¢ ç²ī
äºĶ ä¸ª
çº ł
f rac
åĨĽ éĺŁ
åħį çĸ«
è¾ĥ é«ĺ
èĪ į
åıį æĺł
å¥ ī
çŃī é¢ĨåŁŁ
æķ°æį® åĪĨæŀĲ
å¤© ä½ĵ
èĤ ´
è¿Ļ æĺ¯ä¸Ģ
åħ Ķ
äºĭ ä¸ļ
n ame
èıľ åįķ
æĮĩ ç¤º
çĿ Ľ
èĩ³ åħ³
èĦ ¸
ä¸į åĨį
çİ¯å¢ĥ çļĦ
ä¸ĬéĿ¢ çļĦéĹ®é¢ĺ
ä¿¡ åı·
å£ ³
åĽŀçŃĶ ä¸ĬéĿ¢çļĦéĹ®é¢ĺ
å¤§ å¤ļæķ°
åĬł çĥŃ
ä¸» è§Ĵ
ä¸ĸçķĮ ä¸ĬæľĢ
çĽ Ĺ
æĻ ¶
æĪĸ åħ¶ä»ĸ
èĤ ª
èĦĤ èĤª
äºī è®®
æŁ ł
200 6
ä¸į å°ĳ
çĪ ½
åį ľ
p h
æĹ ģ
æĿĲ è´¨
åĮº ä¸º
è¡¨çİ° åĩº
çļĦç½ ĳ
æ£Ģ æµĭ
o g
Ġ é¦ĸåħĪ
æĭį æĳĦ
åľ°åĮº çļĦ
ä¸Ģ éģĵ
c l
åħ ģ
è¾£ æ¤Ĵ
èĥľ åĪ©
åĲĪ å¹¶
ä½Ĩ åľ¨
åĪĽå»º ä¸Ģä¸ª
èĨ ľ
çĹħ æ¯Ĵ
åľ° éĿ¢
æŁ¥ çľĭ
è®© ä½ł
æ½ľ åľ¨
åħ³éĶ® è¯į
ç ĺ
æĤ ī
ä¸ĭéĿ¢ æĺ¯
çŃī å¾ħ
èĩ £
äººéĻħ åħ³ç³»
å®ĥ åı¯ä»¥
åĽĽ ä¸ª
æµ Ļ
5 5
çİ» çĴĥ
æ¦ ľ
æ²³ æµģ
æĦ¿ æĦı
Ġ ä½ł
ä½ĵ éĩį
Ġ ----
Ġ en
è¢« åĳĬ
æħ Ī
åħħæ»¡ äºĨ
è¿Ļ æ¬¡
d u
æ¼ ı
ç¨ į
çļĦ æĥħåĨµä¸ĭ
èģ ª
ç¨ ¿
å¤§ èĩªçĦ¶
é«ĺ çº§
åħ¨ éĥ¨
é«ĺ éĢŁ
ç»ı çĲĨ
åıį å¯¹
çľŁ çļĦ
èĦ ı
ä¸» æĮģ
ç¿ ¼
æī® æ¼Ķ
ä¼łç»Ł çļĦ
åĲ ¹
æĺĵ äºİ
ä»¥ä¸ĭ æĺ¯ä¸Ģ
æľī è®¸å¤ļ
æª ¬
Ġyou r
çĹĩ çĬ¶
çĳ Ł
è±¡ å¾ģ
ä¸Ń åŃ¦
å¾Ĺ åĩº
éĢı æĺİ
J ava
S E
æ¯ı å¹´
æŁł æª¬
æĭ Ĩ
æķ°æį® éĽĨ
æī¹ è¯Ħ
åŁº éĩĳ
èµ ĭ
æĳĦ åħ¥
æ¼Ķ åĩº
æµ ´
a th
åĬĽ åŃ¦
ä¼ Ĳ
åħ Ħ
çļĦ åīį
ä¸» ä»»
Ġp l
æı Ń
æ®µ èĲ½
è¿Ļç¯ĩ æĸĩç«ł
åĴĮ å¹³
çĶ¨ éĢĶ
æ¬ ²
åľ° ä½į
é¸ Ń
å¤ļ æ¬¡
ç¬¬äºĮ ä¸ª
çĪ ¬
åĴĮ æĶ¯æĮģ
ä¼¦ æķ¦
å½¢ æĢģ
ä¸¥ æł¼
åĮº åĿĹ
b r
åĽº å®ļ
åıĳ æĺİ
äº§çĶŁ äºĨ
å¥³ åŃ©
æ³¨æĦı äºĭé¡¹
Ġ éĤ£ä¹Ī
æķ´ çĲĨ
ç¾İåĳ³ çļĦ
èĤĮ èĤ¤
åĪ° çļĦ
el lo
èĥ½ åĲ¦
çİ° éĩĳ
éľ ľ
Ġs e
æĹ¶ çļĦ
åĨ³ èµĽ
ä¸ĩ åħĥ
ä¸» äºº
éĤ£ éĩĮ
çŃī éĹ®é¢ĺ
èĥ ¸
ä¼¤ å®³
å¤ĩ çĶ¨
çļĦç¼ ĸ
æĸĩ çī©
r y
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
æĢ ª
åĽŀ åĪ°
åĪ ¸
3 2
æĶ¶ çĽĬ
æľĢ åĪĿ
èģĮ ä½į
3 4
éĢĤ çĶ¨äºİ
3 8
æŁ ±
åĮĸ åĲĪçī©
å¼ ¦
çļĦ å¥½
æİ¢ éĻ©
æī© å¤§
ä¸Ńåįİ æ°ĳåĽ½
a ke
æ¯ı ä¸Ģä¸ª
å®ļ å¾ĭ
åı¯ä»¥ å°Ĩ
æł· çļĦ
èĥ ¶
åħĪ çĶŁ
å§¿ åĬ¿
å¸ĥ å±Ģ
å±ı å¹ķ
æŀ ļ
ä¸Ģ åľº
åħ¬ ä¼Ĺ
åĨ³ äºİ
è¡Ĺ éģĵ
æĢ§ åĪ«
äºº ä½ĵ
æ¡ ĥ
éĶ ģ
ä¹Ł éľĢè¦ģ
Ġi m
an ce
( '
æµ ĩ
çļĦçĬ ¶
éģµ å¾ª
Ľ çĽ¾
ĠC h
çĤ ®
è¡Į é©¶
çº ²
æıĲä¾Ľ çļĦ
å¹´ æĿ¥
ä¸¤ äºº
åģ¥åº· åĴĮ
çĪ¶ äº²
or ld
åıĸ åĨ³äºİ
ä»ĸä»¬ åľ¨
æĮĩ æĮ¥
ä½ĵ çİ°
æĻ® éģį
æĵ ¦
å¹² çĩ¥
çªģ çĦ¶
æ¬¡ æķ°
ä¼ĺç§Ģ çļĦ
å°ı åŀĭ
le s
é½ ¿
æĤ ²
æłĸ æģ¯
çļĦ åŁİå¸Ĥ
èĬ Ĵ
ä¸į çŁ¥éģĵ
200 5
èĳ £
ä¹¦ è®°
èĤ º
å¿ĥ æĢģ
Ġ un
çĶ¨ åĵģ
äºĭ çī©
å« Į
åı° åĮĹ
Ġ æĤ¨
å¤© çĦ¶
æĺ¯ ä½įäºİ
ä¸º æĪĳ
6 5
åģļ å¥½
æľī ä¸ĢäºĽ
æ¸© é¦¨
éŃĶ æ³ķ
åĮĸ å¦Ĩ
æĶ¾ å¼ĥ
æ¸¸ å®¢
åĲ¦ åĪĻ
6 7
æľ¬ èº«
Ġ3 0
å¹¿ å·ŀ
èĢ Ģ
Ġr ange
å§ĭ ç»Ī
çļĦ äºĭæĥħ
åħ¶ ä¸ŃçļĦ
è®¤ çľŁ
ç»Ļ ä½ł
Ġ us
ä¸Ģ å¼ł
æīĵ åį°
å®ĺ æĸ¹
æ°´ çļĦ
ro w
ar y
åħ¬ å¼Ģ
äºĭ æķħ
éħį åĲĪ
åĪ Ĭ
åľ¨ ä¸ŃåĽ½
æĮ ¯
åºĶçĶ¨ äºİ
çļĦ åıĺåĮĸ
åĪĿ åŃ¦èĢħ
ä½ľ å®¶
æİ ĺ
è¾ĵåĩº ç»ĵæŀľ
éĻ µ
æ¦Ĥ çİĩ
åĲ« ä¹ī
æĸ¯ åĿ¦
c on
åºı åĪĹ
èµ ¤
èº« å¿ĥ
åĩ Ŀ
Ġel se
éļľ ç¢į
å¹´ åº¦
çĽ¸ æ¯Ķ
çİ¯å¢ĥ ä¿ĿæĬ¤
å¾ĭ å¸Ī
æĭ Ĵ
éĻ ª
åıĳ åĩº
å¾ Ĳ
ï¼ į
éĺ Ķ
8 8
æ°¸ è¿ľ
éĢ Ŀ
202 3
çŃī åĽłç´ł
ä¹Ł åľ¨
å¤§ éĥ¨åĪĨ
æµª è´¹
çİ© åħ·
åŃĲ åĴĮ
çļĦç Ĺ
å´ ĩ
Ġ U
as e
çħ İ
å±± èĦī
åī§ æĥħ
çĶŁ æĹ¥
æľĢ éĩįè¦ģçļĦ
Ġ ä»İ
è¾¾ æĪĲ
å¢ ĵ
éľĢæ±Ĥ åĴĮ
ç¿» çĤĴ
u p
i es
at or
æĸĩ æĺİ
è±Ĩ èħĲ
åįı ä¼ļ
çļĦ çĶµå½±
Ġs elf
çĩ ķ
on g
è¿Ļ æ¬¾
3 7
ä¹Ł å¾Ī
æ¶Ī èĢĹ
æ¯ĶèµĽ ä¸Ń
åŃ©åŃĲ ä»¬
ä¼ Ļ
çļĦä¸Ģä¸ª å¸Ĥéķĩ
m y
åı¤ åħ¸
æľĢ å¥½çļĦ
åįı åĬ©
çº ¤
æµ· æ»©
èĬ ³
æĿ¥ çľĭ
éĥ½ åı¯ä»¥
åħ¬åħ± äº¤éĢļ
å¼º å¤§çļĦ
æľª çŁ¥
åĿ ĳ
ĠT h
ä¸ī å¹´
çĽ Ī
ä¿Ŀ åģ¥
i b
ac h
å» ī
çī¹ å®ļçļĦ
é¸Ł ç±»
æŁ ı
æıĲ éĨĴ
èĩªçĦ¶è¯Ńè¨Ģ å¤ĦçĲĨ
èħ Ĭ
éŃ ħ
å¼ķ åıĳ
è®® åĳĺ
æĹ¶ åĢĻ
åı Ļ
çļĦ æĦŁè§ī
åĲĮ æĦı
ĠS t
èĢĮ åľ¨
çļĦ èĥ½åĬĽ
åĬł æĭ¿
å® ª
ic k
éĨ ĭ
åĴĮ å»ºè®®
èı ĩ
æĬĢæľ¯ åĴĮ
ä¸ľ åĮĹ
æİ¥ è¿ĳ
æ¡ ĳ
ä¸ĭ åįĪ
æĦī å¿«
çĭ ®
åľ° éĵģ
æĭĽ èģĺ
ä¿® å¤į
æĿ¥ å®ŀçİ°
æĹ ¦
åĲĮ äºĭ
æ³ Ĭ
o de
çł ĸ
èĥ İ
çĸ ²
è½ ´
ä¼ĺ è´¨
ç¬¦ åı·
çļĦ é£İéĻ©
200 1
Ġ1 5
æĹ¨ åľ¨
å¥ĸ åĬ±
èıľ èĤ´
ä¼ļ å¯¼èĩ´
å¼ķ å¯¼
èĬĤ çĤ¹
å½ĵåľ° çļĦ
çļĦç Ŀ
åħ± äº§
ç´§ å¼ł
æķ° åĪĹ
s o
å®ŀéĻħ ä¸Ĭ
è®® ä¼ļ
æĺ¯ä¸Ģ åĲį
èĩª æ²»
ä¿Ħ ç½Ĺæĸ¯
æ» ¨
çĶ¨æĪ· çļĦ
æĦī æĤ¦
ä¸ĵ æ³¨
éħ ª
æīĵ éĢł
æĹł éĻĲ
è¿ Ī
ç¼ĸçłģ ä¸º
æ¤įçī© çļĦ
å¼Ĥ å¸¸
æŃĮ è¯į
è° Ĭ
æĮĩ æłĩ
è®¾ å®ļ
æ¼ Ĥ
æĺŁ çĲĥ
æµ ¸
æĲħæĭĮ åĿĩåĮĢ
åģļ æ³ķ
äºº æķ°
ac t
è¿Ľè¡Į åĪĨç±»
Â ¥
èĻ ¾
å°Ķ æĸ¯
æĢ» ä½ĵ
åľ¨ åĮ»çĸĹ
çļĦ ä»·æł¼
èµ· æºĲ
I N
è¢«è®¤ä¸º æĺ¯
é£İ æĻ¯
å° ĸ
å° ĺ
åĵºä¹³ åĬ¨çī©
è¿Ļ ä¸¤ä¸ª
æł¼ å¼ı
åı¯ä»¥ æıĲé«ĺ
ä¿Ŀ çķĻ
æĵ İ
æµĻ æ±Ł
ä¾Ŀ èµĸ
æĺİ çĻ½
å¾Ī å¤§çļĦ
åĮºåĿĹ éĵ¾
ä¹ĭéĹ´çļĦ åħ³ç³»
6 4
è´¢ äº§
æŃĮ æīĭ
éķ¿ æĹ¶éĹ´
ç¾İ æ´²
æĪĲ æŀľ
å¹´ éĹ´
å°Ĩ åĨĽ
éªĮ è¯ģ
ä¸Ģ ç³»åĪĹ
åħģ è®¸
åĽĽ å·Ŀ
çĽĳ æµĭ
ç¬¬ä¸Ģ æ¬¡
" :
æ¶īåıĬ åĪ°
æķ°æį® çļĦ
çī¹ æĢ§
è®¾è®¡ ä¸Ģä¸ª
äºĮ æ°§åĮĸ
é¢ĳ çİĩ
æīĢéľĢ çļĦ
æĴ ĳ
çļĦäºº åı£
çļĦç¥ ŀ
æĺ¯ æĪĳä»¬
æĺ¯åĲ¦ æľī
å¯¼ æ¼Ķ
åĭ ¤
å¼ ¯
èģĶ éĤ¦
èĩ Ĥ
åķĨ åĬ¡
r a
éĢīæĭ© åĲĪéĢĤçļĦ
åį° è±¡
å¼ķ æĵİ
æ²Ļ åıĳ
è·ĳ æŃ¥
å®ļ ä½į
é£İ æļ´
lo g
æĶ¯æĮģ åĴĮ
| --------
åĵª éĩĮ
e ct
æĿĥ åĪ©
åĪ¶ æĪĲ
åľ¨ è¿ĻéĩĮ
å¤ĸ çļĦ
éĤĢ è¯·
æ¯Ķ äºļ
æĲ º
èĤ ł
ä¸ª æľĪ
å¼º åº¦
å¿ĥ æĥħ
c om
éĿĴ å¹´
åĩ ¡
å±± ä¸ľ
å® ħ
Ġs h
å¤ª å¹³
åı ł
ä¾¿ åĪ©
ï¼Ł âĢĿ
å¥ ĳ
äºĭ åĬ¡
è´¸ æĺĵ
å¦ ¹
åħĭ æľį
åĭĩ æ°Ķ
æĩ Ĥ
å°Ĭ æķ¬
ä¸Ģ èĩ´
æĶ¿æ²» äººçī©
æľī åĵªäºĽ
e ar
çļĦç©º éĹ´
åģľ æŃ¢
å¿ĥ çģµ
ç§ĳ å¹»
æĢ ķ
æĪĸ æĺ¯
æĪĲåĬŁ çļĦ
åıĹæ¬¢è¿İ çļĦ
åī ĳ
åĴĮ æ°´
åį ĵ
å¼Ģ å±ķ
åĨ ¥
å¸¦ æľī
åĬł éĢŁ
ic h
åĵģ å°Ŀ
èŀ º
å¯ ĵ
å² Ĺ
åı¯èĥ½ çļĦ
ä½¿çĶ¨ äºĨ
åĬĽ äºİ
é¢Ħ æĬ¥
ç³ Ĭ
ar k
æĦŁ åħ´è¶£
e st
çĶµè§Ĩ åī§
éĢļå¸¸ æĺ¯
å¯¿ åĳ½
en s
è¯į è¯Ń
æŁ¥ æī¾
åł µ
èĬĤ æĹ¥
çļĦ æķ°éĩı
åįĹ æŀģ
B ob
Ġa d
èĸ ª
åħ± äº«
å¿ĥçĲĨ åŃ¦
èĲ¥ éĢł
çĤ ī
ï¼ļ ")
çºª å½ķ
åıĸ åĩº
æĪĳ å¾Ī
Ġ --------
æ¸ ¡
åĳ½ åĲį
åĪĨ æĪĲ
æŃ£ éĿ¢
æķĪçİĩ åĴĮ
il y
è¯· åĳĬè¯īæĪĳ
200 4
æĹ¶ åĪ»
Ġ â
åľº åľ°
æī¿ æĭħ
æİ¥ å£¤
æĪ Ī
èī ĩ
çľŁæŃ£ çļĦ
3 9
Ġ/ /
çĶµ åĬ¨
èģª æĺİ
äº¤ äºĴ
çĶŁæ´» æĸ¹å¼ı
åı¯ä»¥å¸®åĬ© ä½ł
æĽ´ æľī
éĿŀ æ´²
é£Ł è°±
å½± çīĩ
ä¼¼ ä¹İ
æĹĭ è½¬
å¤ªéĺ³ èĥ½
Ġ åı¯ä»¥
æĹ¥ åľ¨
å¾Ĺ åĪĨ
è£ħ å¤ĩ
èīºæľ¯ å®¶
è¿ŀ ç»Ń
åĦ¿ åŃĲ
ç¾¤ ä½ĵ
æĬ ĳ
æľĢ ä½İ
å¹¶ ä¸įæĺ¯
è´· æ¬¾
éĢī æīĭ
æīĢ å±ŀ
å®¶åºŃ æĪĲåĳĺ
ç³»ç»Ł çļĦ
çº¿ è·¯
æľĪ çĲĥ
ç»´ ä¿®
æŃ¦ åĻ¨
ä¸Ĭ åįĩ
éľĢè¦ģ åľ¨
i p
å¯¹ æ¯Ķ
çļĦ å¤©æ°Ķ
æī© å±ķ
è®¢ åįķ
åĩł ä¹İ
é£ ĺ
çĶ¨æĪ· è¾ĵåħ¥
å¯¹æĸ¹ çļĦ
å° ¿
ä¸Ĭ ä¸ĭ
çªģ åĩº
çļĦçĿ ¡
æŃ¤ æĹ¶
æ¢ ¯
çŃ ¹
æĻ ´
çĲĨ è´¢
åŃ¦ æľ¯
Ġæĺ¯ çļĦ
åĬłæĭ¿ å¤§
èĮĥåĽ´ åĨħ
âĢ ĵ
âĢĿ ï¼Ī
å¹³æĸ¹ ç±³
åĩº è¡Į
åİ» ä¸ĸ
éĢı è¿ĩ
åıª è¦ģ
æĺİ äº®
å¥¥ è¿Ĳ
æĬ ¹
èĿ ¶
éĺĲ è¿°
æ©Ħæ¦Ħ æ²¹
and om
æ¿Ģ åĬ±
å¢ĥ åĨħ
çļĦçĭ ¬
åĿ Ľ
ä¹ī è¯į
è¯Ŀ é¢ĺ
ç¤¾ä¼ļ çļĦ
åĪĨå¸ĥ äºİ
åĽ¾ ä¹¦
ä¼ł è¾¾
i de
èĩª ä¸»
çº¿ çļĦ
è§£ æĶ¾
ä¸ĵ å®¶
åĲ¬ è¯´
æ°´ åĴĮ
4 00
èĢĥ è¯ķ
é» Ľ
éĥ¨ éķ¿
è¯Ńè¨Ģ æ¨¡åŀĭ
èħ ¹
å¼º çļĦ
Ġ åĬłåħ¥
æĸ ĳ
åĲĪ æ³ķ
ä¸ī ç§į
an a
åı¯èĥ½ å¯¼èĩ´
å¹¿ åľº
ç´§ æĢ¥
äºº åĴĮ
æĪĺ çķ¥
æ¼Ķ åĶ±
æľŁ æľĽ
åħ ½
æĦıå¤§åĪ© éĿ¢
åĵģçīĮ çļĦ
Ġ 50
åĴĮ ä¸į
Ġb y
èŀį åĲĪ
åģ ¿
éģį åİĨ
äº§çĶŁ çļĦ
å°ĳ å¹´
æıı ç»ĺ
åĴĮ æĮĳæĪĺ
Ġ ä»¥ä¸ĭæĺ¯
oo k
åºĶè¯¥ æĺ¯
æĻ Ĵ
è´ «
çĶŁæĪĲ ä¸Ģä»½
åĴ ª
è¢ ĸ
è¿Ľ æĶ»
æĿ¥ çļĦ
åİŁ å§ĭ
åĮº åĪ«
æĬĢèĥ½ åĴĮ
Ġ è°¢è°¢
ä¸įä»ħ ä»ħ
èĬĿ å£«
æĤ ł
æ¼ ł
ab le
åĪ ł
è¿Ļ æĦıåĳ³çĿĢ
æľīéĻĲ åħ¬åı¸
æĽ´å¥½åľ° çĲĨè§£
ä¸Ģ é¡¹
æ¶Ī æģ¯
åĪĽ ä¸ļ
å¿Ĺ æĦ¿
æĺ¯ åĽłä¸º
åĽ½ åĨħ
å·² çŁ¥
o od
åŀ Ĥ
éľĢè¦ģæ³¨æĦı çļĦæĺ¯
åĩ ¤
ä¸ľ åįĹ
ç¿ ħ
åįĹ äº¬
è®© äººä»¬
èĦ Ĩ
èĭ± éĽĦ
éŃ ı
çĽ¸ åıį
ä¸º ä½ł
ç¬¬ äºĶ
4 4
æĮĩ å®ļ
ç¯® çĲĥ
æĬ ļ
ä¹Ł å°±æĺ¯
ç¼ĸ åĨĻä¸Ģä»½
e p
ç®¡ è¾ĸ
éħį æĸĻ
æµĵ éĥģ
æ» ´
è¿ĲåĬ¨ ä¼ļ
ãĢ Ģ
çĵ £
å¤§ åĮº
èº«ä½ĵ çļĦ
ç»ĦæĪĲ çļĦ
åľ° ä¸ĭ
åŁºæľ¬ çļĦ
éľĢè¦ģ è¿Ľè¡Į
å°ı ç»Ħ
$ $
ä»ª å¼ı
åĴĮ æĥħæĦŁ
ç® Ń
æľŁ å¾ħ
åı¯ä»¥ è¢«
è£ ¤
çļĦ åĢ¼
ä¸Ń æľī
åħ¬ æŃ£
åĲĪçĲĨ çļĦ
çļĦçĬ¶ æĢģ
å¤§ ä¼ļ
åŀ «
é¢ĨåŁŁ çļĦ
å¹³åĿĩ åĢ¼
çļĦçĪ± æĥħ
n g
ç§ ¦
ç»ĦæĪĲ éĥ¨åĪĨ
æľº æ¢°
æĭī æĸ¯
ä¸ľ éĥ¨
çº¤ ç»´
ĠĠĠĠĠĠĠĠ ĠĠĠ
äºĮæ°§åĮĸ ç¢³
èĽ ĩ
æľ¬ è´¨
ä»¥ åħį
åĽ¢éĺŁ æĪĲåĳĺ
ä¸Ģ åĪĩ
å¹¶ äºİ
çļĦçĿ¡ çľł
è¾ĥ ä½İ
ä¿Ŀ åħ»
çļĦç¨ ĭ
Ġ >
è¿Ļ åı¥è¯Ŀ
æĿ¥ åĪ°
æ²Ļ æĭī
åĢ¾ åĲ¬
åħ³ éĹŃ
è° ĵ
æĻºèĥ½ å®¶å±ħ
èº«ä½ĵ åģ¥åº·
å·´ å£«
ä½ĵ ç§¯
åı ¹
èĲĿ åįľ
å¿ §
çĽ Ĵ
) ï¼Į
ç¡® å®ŀ
åıĭ è°Ĭ
æ¼Ķ å¥ı
çĬ ¹
çĭĹ çĭĹ
y st
çĽĲ åĴĮ
çİĽ ä¸½
ä¸º äºº
çļĦå¤§ å°ı
æł¹æį® èĩªå·±çļĦ
è ĺ
æĽ´å¥½åľ° äºĨè§£
çĶ» éĿ¢
g r
æľĢ æĸ°
åıĸ ä»£
åŁİ åĮº
ä»Ķ ç»Ĩ
åľ° ä¸Ĭ
æĻ® æŁ¥
æµģ åĬ¨
ç¥ŀç§ĺ çļĦ
lo at
é¼ »
çĽ® çļĦåľ°
éŁ© åĽ½
ä½Ľ æķĻ
åĽŀ å¿Ĩ
æķĻ åłĤ
çļĦçŁ Ń
L E
æ°Ķ æģ¯
èµĽ åŃ£
çļĦ ä¸ĢäºĽ
èŃ¦ æĸ¹
æıĲä¾Ľ ä¸Ģä¸ª
é«ĺ è´¨éĩı
Ġn e
g et
è¯¢ éĹ®
å½ »
èĥ½å¤Ł åľ¨
] ,
æŀĦ å»º
ç¬¬ åįģ
å¹¶ ä¸º
ç©¿ çĿĢ
åı¯ä»¥ çĶ¨
Ġst r
æĢ» äººåı£
c ri
å¹¿ æĴŃ
çļĦ é¦ĸ
æŁĶ è½¯
é¢ ģ
å§ĵ åĲį
ï¼ļ ãĢĮ
è¯¥ åĽ½
Ġ ä¸Ń
å¾ ½
åı« åģļ
å±ŀ æĢ§
å¹¶ å°Ĩåħ¶
åİ ¦
åįĩ çº§
ãĢĤ "
Ġ è®¡ç®Ĺ
é ¬
è° ¨
åĽ½ çİĭ
çģ« å±±
èĩªåĬ¨ åĮĸ
åı¤ èĢģ
æħ İ
è¥¿ éĥ¨
Ġ2 5
ä¸ §
6 6
i al
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
åĽ¢ ä½ĵ
å½ĵ ä¸Ń
åı ī
çķĮ éĿ¢
åĳĪçİ° åĩº
åĩ» è´¥
èĪĴéĢĤ çļĦ
è®² è§£
im port
15 0
çĪĨ åıĳ
æ· Ģ
æłĩ é¢ĺ
æĸĩæľ¬ åĨħå®¹
åĽ¾ æ¡Ī
ä»ĸ äººçļĦ
åĽŀ æĶ¶
l l
åĬŀåħ¬ å®¤
æĬ ĵ
èµ ł
å¥¶ æ²¹
è¾ ©
æĭĴ ç»Ŀ
æĴŃ æĶ¾
å°ı çº¢
çģ« æĺŁ
ri ght
å¯Į æľī
åĨ¬ åŃ£
ä¼ ı
lo w
c m
æĻ ¨
å¤ĸ éĥ¨
éĴ ®
å®īåħ¨ æĢ§
èĬ± è´¹
çŃī åľ°
ç®Ģ çº¦
çŃ Ľ
æ¯ıä¸ªäºº éĥ½
å¸Ĥ æ°ĳ
å¹¶ ç»Ļåĩº
å»ºçŃĳ çī©
âĢĭâĢĭ âĢĭâĢĭ
å¦Ĥä½ķ åľ¨
èĭ± å°º
Ġ arr
ç»Ł ä¸Ģ
è¶ħ çº§
çİ¯å¢ĥ åĴĮ
Ġ å¯¹äºİ
æĳĦ æ°ı
å°Ĩ ä»¥ä¸ĭ
å¸Į èħĬ
çº µ
8 5
æ¿Ģ åıĳ
éĢ Ĩ
æľĢ å°ı
å¤ľ æĻļ
éĻĪ è¿°
çļĦ é£Łçī©
éļ¾ åº¦
çļĦç ³
ä¿¡ çĶ¨
æ» ĭ
è¡ĮæĶ¿åĮº åĪĴ
æĻ¯ è§Ĥ
å¹ ½
éĶ ĭ
å°¤åħ¶ æĺ¯
å¤« å¦»
ä¸į å¾Ĺ
è§Ĥ æµĭ
a h
åħ¬ åħĥ
ä¿ ±ä¹Ĳ
ä¼ĺ åħĪ
åĭĩ æķ¢
è¿ĩ æ»¤
æµģ éĩı
çŁ ĽçĽ¾
å®Į ç¾İ
ä¼ļ å¯¹
æĦıè¯Ĩ åĪ°
æĶ¹ éĿ©
åºĶ å½ĵ
åı¯èĥ½ä¼ļ å¯¼èĩ´
éĿŀå¸¸ éĩįè¦ģçļĦ
" ï¼Į
é³ į
ĠĠĠĠĠĠĠĠ Ġ
åľ° åĽ¾
éħį ç½®
ä¸ĵä¸ļ çļĦ
ä¿±ä¹Ĳ éĥ¨
åįģ å¹´
è¡¨è¾¾ äºĨ
è´§ å¸ģ
ç¢ ±
æĢĿ è·¯
éģĹ ä¼ł
ou s
å±Ĥ æ¬¡
åľĨ å½¢
æķĻ å¸Ī
v al
ĠP ro
éĶ ¡
é¹ ¿
è½¬åĮĸ ä¸º
éĩĮ æĸ¯
å·¨ å¤§
çļĦ åĬŁèĥ½
q ue
4 9
èĢĥèĻĳ åĪ°
åı· çº¿
å¤ļæł· æĢ§
æµ·æĭĶ é«ĺåº¦
åł Ĩ
åħĪ è¿Ľ
è¾Ĳ å°Ħ
$ ï¼Į
å¹¶ å¯¹
ä¸īè§Ĵ å½¢
è¥¿ åĮĹ
è¿Ľ å±ķ
çłĶ åıĳ
è´ŁéĿ¢ å½±åĵį
è´ ¯
çĵ ·
çļĦç Ļ
éĿ¢ åĽ¢
æ¼Ķ åĮĸ
è¥¿ åįĹ
P h
äº² åŃĲ
t on
çļĦç ´
åı¯ä»¥ ä¸º
é¢ Ī
æĺİ å¤©
èĭ± å¯¸
æĪĳ éľĢè¦ģ
åı¯ä»¥å¸®åĬ© æĪĳä»¬
çħ§ é¡¾
o st
æĺ¯ æ³ķåĽ½
èī² è°ĥ
çĶŁæĪĲ ä¸Ģé¦ĸ
ä¸ª ä½ĵ
ä¼ł è¯´
éģĹ äº§
æĺ¯ä¸Ģ æ¬¾
' )
æİ¥ çĿĢ
åĮ¹ éħį
çĽ¸äºĴ ä½ľçĶ¨
æ¯« ç±³
ç½ ©
æ¡Ī ä¾ĭ
äº ķ
çļĦ æµ·
æĺ¯ çļĦ
çī §
å°ı è¡ĮæĺŁ
å°Ķ çľģ
æİ¨ è¿Ľ
èī ³
å»º äºİ
èİ ²
l ic
çº¿ ä¸Ĭ
çĭ ±
ä½ł åľ¨
èįī èİĵ
ä¸ ĺ
æĦı å¿Ĺ
200 3
8 9
ä¸į èī¯
éĤ£ ä¸ª
å¤§ æĪĺ
ä¸į éľĢè¦ģ
åħ¬ å¸ĥ
åıĺ æļĸ
Ġh ave
çļĦ ä½ľçĶ¨
è° ľ
æĥ ľ
æľ¬ æĸĩ
çī¹åĪ« æĺ¯
è¾ ī
yst em
å¸¦æĿ¥ çļĦ
æĽ´ é«ĺçļĦ
åı¯ä»¥ æĺ¯
æ¸ħ æĸ°
æ·± è¿ľ
ä¸Ģ ä»¶
çľĭ çľĭ
æī «
æĹĭ å¾ĭ
o ice
ç«ĭ åį³
æĻ® åıĬ
åĩº èī²
åĲĦ èĩª
åŀĭ åı·
ĠĠĠĠĠĠĠĠ ĠĠ
å¾Ī å¥½çļĦ
4 7
æĹł çº¿
çļĦ é«ĺ
æĺ¯ä¸Ģ éĥ¨
åı¯ä»¥ èĢĥèĻĳ
æĽ´ å¿«
æĿĤ å¿Ĺ
Ġn ew
è¿Ľ å£«
o v
åĩĨå¤ĩ å¥½
å¤ļ åħĥ
é©¬ æĿ¥
éĢĤ å®ľ
åĨĻä¸Ģ é¦ĸ
Ġ ä½łå¥½
ä¸Ń éĹ´
ä»¥ä¸ĭåĩłä¸ª æĸ¹éĿ¢
is h
or k
ç¼ĸç¨ĭ è¯Ńè¨Ģ
ç¾İ è§Ĥ
æ³¨æĦı åĬĽ
th er
å°Ĭæķ¬ çļĦ
æķ£ æĸĩ
hi le
æĸ¹ çļĦ
çļĦ åĲĮæĹ¶
çļĦ ä¸ĸçķĮ
æĪĳ å°Ĩ
äº¤ å¾Ģ
çĳ °
æ³ Ħ
æŀģ ç«¯
çĽĳ ç®¡
å°ı åĿĹ
åº¦ è¿ĩ
åģľ è½¦
çļĦ æľįåĬ¡
ä¸Ģ éĥ¨
æŃ §
éĩį åĬĽ
æıĲ åīį
å±± å³°
éŃ Ĥ
èĥ½å¤Ł å¸®åĬ©
ç» ³
çĥŃ æĥħ
æķĻ ç»ĥ
æĮī éĴ®
å·¥ç¨ĭ å¸Ī
çļĦçľ ĭ
é»ĳ æļĹ
æĹłè®º æĺ¯
. ãĢĬ
çĻ Į
ç¦ı åĪ©
å®ļ åĪ¶
G B
åĭ ĥ
ä»£çłģ å®ŀçİ°
æ¶µ çĽĸ
ï¼Į ï¼ī
æ¡ ¶
r t
è®© ä»ĸä»¬
çĲ ³
èį Ĵ
an n
èĢĮ æĪĲ
è°ĥ çĶ¨
ç¦» åŃĲ
çĶŁæ´» çļĦ
å¤ĸ äº¤
åĮĸåŃ¦ åıįåºĶ
æĥ §
å½ĵ éĢī
æī¾ åĩº
Al ice
è¯· æ±Ĥ
éĩĩçĶ¨ äºĨ
æ¡ Ĥ
åħ±äº§ åħļ
ä¸ľ äº¬
ä¸į å¤ª
Ġw ord
åĬ £
ä½ł æĺ¯
æµģ çķħ
åĬ¨ çĶ»
åıĹ ä¼¤
æĺŁ ç³»
çļĦ è¯Ńè¨Ģ
ä¿Ŀ åŃĺ
ä¸ĭ åĪĹ
çļĦ éĢŁåº¦
çļĦ æĬĢæľ¯
ol or
Ġ :
æĳĺ è¦ģ
åħ¶ å®ĥ
åĽĽ å¹´
åĨ¥ æĥ³
Ġ å¤§
èķ ī
ä¸į ä¹ħ
å³ ¡
éģĩ åĪ°äºĨ
æ¾³ å¤§åĪ©
æ¸¸æĪı çļĦ
éĺŁ ä¼į
æĺ¾ èĳĹ
å¤Ħ çļĦ
å¼º å¤§
é±¼ ç±»
åĪ¤ åĨ³
å§ Ĳ
æ §
å« ©
s ort
æĪĳ æĺ¯
æ¾³å¤§åĪ© äºļ
èĩªçĦ¶ çģ¾å®³
ä¸ªäºº çļĦ
éĢļå¸¸ ä¼ļ
Ġ ï¼Ī
åĪĨæŀĲ åĴĮ
æ¡Ĩ æŀ¶
è§£ çŃĶ
éĩį å¤§
è´Ŀ å°Ķ
S t
æĺ¯ä¸Ģ é¡¹
æĪĳä»¬åı¯ä»¥ ä½¿çĶ¨
åŃĺåľ¨ çļĦ
å¦Ĥä½ķ åĪ¶ä½ľ
æĿĥ çĽĬ
8 00
æ¸ħ çĲĨ
åı¯èĥ½ éľĢè¦ģ
å¦ ®
çŃī äºº
cri pt
åıĳçİ° äºĨ
æģĭ çĪ±
å¾Ī æľī
æıı åĨĻ
åĳĺå·¥ çļĦ
åĺ ´
è®¤ åı¯
çĸ ı
åĬł å¯Ĩ
åĴĮ åĪĨæŀĲ
ä¸ªæĢ§ åĮĸ
Ġ æĬĬ
æľī æ²¡æľī
åĴĮ è¡Įä¸º
c k
ä¸º ä¸Ģä¸ª
å½ĵ ä»£
åºĨ ç¥Ŀ
ä¹ĭ ä¸Ń
Ġs o
åĨį çĶŁ
è¢« å¹¿æ³Ľ
ä¸ºæĤ¨ æıĲä¾Ľ
æ²³ åįĹ
ä½ Ĳ
åĲĮ ä¸Ģ
å¥ Ī
åįļ å£«
äº¤ æį¢
è´¨éĩı åĴĮ
çļĦçľ ¼
è¶Ĭ åįĹ
åŃ¦ ç§ĳ
æ¸¸æĪı ä¸Ń
ĠT r
æµĩ æ°´
åĪł éĻ¤
æ°Ķ è±¡
i re
å· ¾
ç»Ł æ²»
åĩº åıĳ
res s
æĸĻ éħĴ
s elf
çº¢ æ¥¼
çļĦç¾İ å¥½
æĪĲ çĨŁ
éĥ½ åľ¨
æĸĩåĮĸ çļĦ
æķ° åĢ¼
Ġ ç¡®å®ļ
I n
çļĦçĪ ¶
çł Ĥ
T h
æĸĩ çĮ®
Ġ X
åıĤ èµĽ
ig n
éĺ ģ
æ¸© å®¤
æĽ ¹
ä¸ŃåĽ½ å¤§éĻĨ
éª Ĺ
çĩĥ æĸĻ
âĢ Ļ
æĮ ĸ
çĽ¸åĲĮ çļĦ
æĪĺ å½¹
èµĦ æł¼
ç»Ī äºİ
ç² ®
è¾¹ çļĦ
åĪ« äºº
èĢĲ å¿ĥ
æ¯ı åĳ¨
7 7
+ +
åľ¨ æľªæĿ¥
å¤§ èĦĳ
å¾Ī å¿«
æµ Ĩ
Ġa b
c ount
èĺ ĳ
çļĦ æľºä¼ļ
æĬ¤ çĲĨ
çĥ Ĥ
å¥ Ķ
äººåı£ æĻ®æŁ¥
åħ¶ä¸Ń åĮħæĭ¬
ä»ĭç»į ä¸Ģä¸ĭ
åĴĮ ç®¡çĲĨ
æĪ Ĵ
T C
å°± ä¸ļ
éĢīæĭ© ä¸Ģä¸ª
çĭ Ĥ
6 8
éħ µ
éŃħ åĬĽ
çľ¼ çĿĽ
èį· åħ°
200 2
ä»¥ä¸ĭ åĩł
èīºæľ¯ åĵģ
åľ° äº§
åĳ½ ä»¤
è¿Ļä¸ª è¡¨æł¼
çļĦç Į
æł ½
p le
èĦ Ĭ
å¤© æĸĩåŃ¦
ä¸Ģ æĿ¯
æĿ Ĩ
è¿Ļ éĥ¨çĶµå½±
åħ¶ åĲİ
ç®Ģ ç§°
çļĦç¾İ é£Ł
ä¸Ģ åº§
ç»§ æī¿
éĻ¤ æŃ¤
åĪĨåĪ« ä¸º
Ġin put
æĹł äºº
èĺĳ èıĩ
åĲĳ éĩı
åĲĦ åľ°
æ¾³ éĹ¨
åĸĤ åħ»
èĩ³ ä»Ĭ
è¿Ļæĺ¯ åĽłä¸º
èĵ Ħ
ä»¥ åĲİ
ç»ĵæŀĦ åĴĮ
èī ĺ
æĽ¿ ä»£
çļĦçģ µ
ä»¿ ä½Ľ
æ³¨ åĨĮ
Ġ äººå·¥æĻºèĥ½
æĪĳä»¬ ä¼ļ
äºĶ å¹´
m e
çļĦ è¯ĹæŃĮ
åĨ° ç®±
çĲĨ æĥ³
çļĦçľĭ æ³ķ
çŃī å¤ļç§į
æĿĲæĸĻ åĴĮ
å¹³ çŃī
èĥ¡ èĲĿåįľ
e b
æ²Ļ æ»©
æ£ ķ
ä»¥ä¸Ĭ è¿Ļæ®µ
Ġn ot
åı¯ä»¥ ä½¿
éŁ µ
åİĭ åĬĽåĴĮ
æµ ¦
åīį æĻ¯
æĹ¶éĹ´ çļĦ
ç§ĭ å¤©
éĽ ¾
åĽ¢éĺŁ åĲĪä½ľ
åı£ è¯Ń
å¾Ī å¤§
4 2
èĤ ©
èħ ¾
9 5
è´¦ æĪ·
æĭħ å¿ĥ
èį ¡
æº ¯
å®¢ åİħ
o k
å¿ł è¯ļ
åĽŀçŃĶ è¿Ļä¸ªéĹ®é¢ĺ
æĬĢå·§ åĴĮ
199 0
ä¼ĳ éĹ²
æĹ© é¤Ĳ
åıĳåĬ¨ æľº
çİ¯ èĬĤ
Ġ å°ı
åħ¶ä»ĸ çļĦ
èĨ Ģ
æĺ¯ ç¾İåĽ½
éħ± æ²¹
çĨŁ æĤī
æĺ¯éĿŀå¸¸ éĩįè¦ģçļĦ
æľĢ æĸ°çļĦ
ä¾ ¯
éľĢè¦ģ çļĦ
æį Ĳ
å¤ı æĹ¥
æ³ķ è¯Ń
çº¢æ¥¼ æ¢¦
Ġ å¯¹
ä»¥ä¸Ĭ æĺ¯
æĸĩç«ł ä¸Ń
é² ¸
è´¢ å¯Į
æĹ© ä¸Ĭ
è® ¼
ä¹Ł ä¸į
åĬ³ åĬ¨
ä¼ģä¸ļ çļĦ
âĢ¦ âĢ¦
åĽŀ å½Ĵ
åİĨåı² ä¸Ĭ
ç¥ Ń
åĻ ª
ä» ĵ
äº« çĶ¨
å¥¶ éħª
åĵª ç§į
åķĨ åºĹ
è®¾è®¡ å¸Ī
åģ ·
æµģ è¡ĮçļĦ
å¹´ åľ¨
ä¼ļ æľī
æŀĦ éĢł
Ġ å»ºç«ĭ
æĽ¿ æį¢
ow n
æĺİ æľĿ
è£ Ķ
é¡º åĪ©
æĿ¥ è®¡ç®Ĺ
å¥¥ æŀĹ
æĢİä¹Ī æł·
ãĢĤ ãĢį
æĿ¡ æ¬¾
Ġ çº¢
ä¸»è¦ģ æĺ¯
æĢ» éĿ¢ç§¯
åĴĮ çĲĨè§£
æĸĩ èīº
é¦Ļ èķī
ä¸Ģ æľ¬
æĭ ĸ
æŃ£ æĸ¹
åĩº çİ°åľ¨
çļĦç ĸ
æ±Ł èĭı
Ġf loat
è¾ħ åĬ©
å¤ı å¤©çļĦ
en g
ä¼Ĺ å¤ļ
åĩºçİ° çļĦ
æĸĩ æ¡£
æķ£ æŃ¥
s um
æ¿Ģ çĥĪ
éĵ ĥ
E R
4 6
æķ°æį® åºĵ
å¤§ äºİ
éĢĲ æŃ¥
. "
é¬ ¼
æ± Ĺ
é»ĳ èĥ¡æ¤Ĵ
æİ¥ æĶ¶
ç«ĭ æ³ķ
åŃ¦ ä½į
ç¦ı å»º
å¹¶ è¿Ľè¡Į
è¿ĺ èĥ½
çĮ« åĴª
du ct
æĽ´ é«ĺ
åŃ ķ
æľĪ åı°
æµ· å²¸
æ··åĲĪ çī©
åħĶ åŃĲ
å·´ è¥¿
åĩ Ń
èĴĻ åı¤
èĲ §
æľĢ æĹ©
åĩºçİ° äºĨ
åıĳ å°Ħ
Ġ1 8
èĩ´ åĬĽäºİ
ä¸į å¤Ł
åį ī
ä»İ äºĭ
æ¬ º
åĲ ķ
ĠæĪĳ æĥ³
å°ı åŃ¦
çİĭ æĺŁ
é¢Ħ çĥŃ
è°ĥ æĸĻ
çļĦç Ĥ
çĶ· åŃ©
ä¾Ŀ æį®
éĻ¤æŃ¤ ä¹ĭå¤ĸ
æłĩ çŃ¾
åĴĮ ä½¿çĶ¨
é¡µ éĿ¢
å¹´è½» äºº
æ² ¸
E m
åĩ Į
åĩº èī²çļĦ
æŁ ¯
ç¼ĸ åı·
å¡ ĺ
åŀĭ çļĦ
å® ı
éĴ »
æľĪ çļĦ
åħį è´¹
è£ Ļ
è¯Ħ åĪĨ
èĬ± åįī
å¹´ ä»½
æľī äºº
er t
æł¹æį® ä»¥ä¸ĭ
çİ «
éĹ´ çļĦ
ç»ıéªĮ åĴĮ
AP P
it e
æĦı å¤ĸ
åĪĨ è§£
é¢Ħ è®¡
æĶ¯ æĴĳ
éĢĤ çĶ¨
åĨ· éĿĻ
éĴ¢ çĲ´
ä¼ ª
æĦ Ī
çĶŁ åĬ¨
è¯ī è®¼
è¾ ½
çĥ¤ çĽĺ
ä¸ĩ ç¾İåħĥ
å·¥ èµĦ
ä¹Ł éĿŀå¸¸
å¦Ĥæŀľ æĪĳä»¬
æ·±åĪ» çļĦ
æľº åħ³
) ãĢĤ
çļĦ æŃ¥éª¤
" >
åĪĨ æķ°
éĢĶ å¾Ħ
åģı å¥½
åŁº çĿ£
æĽ´ å¤§çļĦ
çĩĥ çĥ§
ç»ĺ çĶ»
æł· æľ¬
æĮĩ çļĦæĺ¯
æķı æĦŁ
åŁİ éķĩ
åĲĪ æĪĲ
èħ »
æ¸ħ æ¥ļ
ä¼Ļ ä¼´
æħ ķ
9 8
å¤©çļĦ å¤©æ°Ķ
ä¸ŃåĽ½ çļĦ
ç´ł è´¨
ä»¥ éģ¿åħį
æ¹¿ åº¦
å®ŀéĻħ æĥħåĨµ
å¥¥æŀĹ åĮ¹
çļĦç¼ĸ ç¨ĭ
åŃĲ éĩĮ
åĪĿ æľŁ
S T
ä¸ĵ éĹ¨
ç±³ é¥Ń
åĴĮ å®īåħ¨
Ġ Â¥
çļĦ æķĪæŀľ
åľ¨ ä½¿çĶ¨
åıĤ è§Ĥ
åĮħ è£ħ
åľ° æĿ¿
éĻ¤ ä»¥
ç¨³ å®ļçļĦ
æģ °
çĶ¨æĪ· ä½ĵéªĮ
åīį çļĦ
7 8
Ċĉ ĉ
åĪĿ å§ĭ
æĮ «
çĽĳ çĿ£
çļĦ å½¢å¼ı
èĬĤ çº¦
å·ŀ å¸Ĥ
è®° èĢħ
åħĦ å¼Ł
ä¸» åĬ¨
ç¹ģ æ®ĸ
18 0
è´Ł åĢº
éĥ Ń
å² Ń
çŃī ä¿¡æģ¯
åı¯èĥ½ æĢ§
åĢ¾ åĲĳ
éĥ½ èĥ½
çļĦ ä»£è¡¨
åĭ º
ä¾ £
åĵ ¦
æ¨¡ åĿĹ
å¤ªå¹³ æ´ĭ
ãĢį ï¼Ī
çİ« çĳ°
åı¸ ä»¤
èĬ± æľµ
å±ķ è§Ī
] [
çħ® çĨŁ
åĪĹ ä¸¾
ãĢĤ ãĢĬ
åŃ¦çĶŁ çļĦ
å¦Ī å¦Ī
åĪĨåĪ« æĺ¯
è¥¿ åĵ¥
Ġth is
ç©º è°ĥ
ä¸Ń éĥ¨
è¢« è§Ĩä¸º
çİ°åľ¨ è¯·ä½ł
ä»£ è°¢
èµ Ķ
åıĳ çĶµ
çŁ© éĺµ
æ¦Ĥ æĭ¬
Ġ our
å«Į çĸĳ
æĮĩ ä»¤
åĽ¾ä¹¦ é¦Ĩ
è§Ĥ çľĭ
çĽ´ èĩ³
æľĪ ä»½
Ã Ĺ
Ġ+ =
å¨ ĺ
åĪĨç±» ä¸º
å®Ŀ çİī
å¹² æī°
å¥³ åĦ¿
ç§ģ äºº
åıĳå±ķ çļĦ
å¿ĥçĲĨ åģ¥åº·
æŁĶ åĴĮ
èĭı èģĶ
åĩºçĶŁ äºİ
åħĪ åĲİ
è¯ ŀ
è®¾è®¡ åĴĮ
Ġ å®ļä¹ī
ä½Ĩ æĪĳ
å¤ı ä»¤
Ċ ĠĠĠĠ
æ»¡æĦı åº¦
åĨ· åį´
æĹ¶ åħī
å²© çŁ³
æ½ľ åĬĽ
äº ¨
çĸ« æĥħ
199 9
éĶ¦ æłĩ
å¤§ æ¥¼
åŃ Ł
éĩıåŃĲ åĬĽåŃ¦
" ãĢĤ
Ċ ĠĠĠĠĠ
åĲ Ĭ
e e
ç¥ ¥
çļĦç ¡
éĢļ ä¿¡
èĲ¥éĶĢ çŃĸçķ¥
é¹ ħ
èº«ä½ĵ åĴĮ
è¿ĻäºĽ éĹ®é¢ĺ
èĢĮ ä¸į
æģĲ é¾Ļ
æıĲåĩº äºĨ
çģµ æĦŁ
å¢¨ è¥¿åĵ¥
ä¼ļ å½±åĵį
Ġ at
è¿Ļæł· åı¯ä»¥
åħħ çĶµ
ç§į åŃĲ
åħ¶ å®ŀ
å¤§æ°Ķ å±Ĥ
æ¯ı ä¸Ģ
èĶ ¡
èħ °
ç¾¤ å²Ľ
ä¸Ģ æĹ¦
èĪŀ åı°
åĲ¬ åĪ°
æ¹ĸ åįĹ
æĬķ ç¥¨
ä»¥ æŃ¤
199 8
it ion
èĭ± æł¼åħ°
æĬ ¢
åħĭ çļĦ
åĲ¯ åĬ¨
è¿ĳ å¹´æĿ¥
ç©º ä¸Ń
æĳĦæ°ı åº¦
æĹ¥ èĩ³
æī¾ åĪ°äºĨ
æĬķèµĦ èĢħ
ä¸Ģä¸ª éĹ®é¢ĺ
åĮĸå¦Ĩ åĵģ
å®¢æĪ· çļĦ
çľĭ åĪ°äºĨ
B C
äºĳ åįĹ
éĤ® æĶ¿
è¯·éĹ® æĤ¨
åĪĹè¡¨ ä¸Ń
æ¶ Į
å¼ł ä¸ī
ä¸ĸçķĮ çļĦ
çĽ¸ çŃī
æĸ Ĳ
æĭĵ å±ķ
åĴĮ éľĢæ±Ĥ
å¾Ĺ ä»¥
è§£éĩĬ ä¸Ģä¸ĭ
ç¬¬äºĮ æ¬¡
å¤§ åľ°
è ©
å¤ ¹
æıĲ åĪ°
çļĦçľ ģ
æľīæĹ¶ åĢĻ
æłĳ æľ¨
åħ¨çĲĥ åıĺæļĸ
ç© ·
ç«ŀäºī åĬĽ
åĬ¨ æĢģ
æĺ¯ éĢļè¿ĩ
ç®Ģ åİĨ
è½¬ ç§»
æĢ Ĵ
å¹³ éĿ¢
A T
ç¢ °
çĽ´ å¾Ħ
çļĦç¤¾ äº¤
ä¹Ĳ è¶£
æĵ ħ
ä¾¿ æį·
å¥¥æŀĹåĮ¹ åħĭ
å®ī éĿĻ
æ°´ åŁŁ
æ³¨ éĩĬ
å¤© æ´¥
åĲ ¨
ä»¥ä¸ĭ æŃ¥éª¤
å¹¿æ³Ľ çļĦ
åı Ľ
i o
äºº ç¾¤
ç®¡çĲĨ åĴĮ
èĤī ç±»
èĢ į
æĺ¾ å¾Ĺ
æŁĲ ç§į
.. .
ä½ł ä¼ļ
çĽĳ æİ§
è§Ĥ å¿µ
ä¹Ĳ åĻ¨
è¾ĥ å¤§
ç§ĺ å¯Ĩ
æĽ¾ ä»»
è¿Ļ ä¹Ł
å½¢æĪĲ äºĨ
çĤ¹ çļĦ
| ----
ä¼¦ çĲĨ
èģĮ è´£
æĴŃ åĩº
æī¿ è®¤
æĮĳæĪĺ åĴĮ
æĪĳä»¬ åľ¨
çļĦçģ «
æĦŁ çŁ¥
æĬ¥ è¡¨
é£İæł¼ çļĦ
æ²Ļ æ¼ł
Ġ åĪ¶ä½ľ
å®¹ åĻ¨
éĢī çĶ¨
åĳ½ è¿Ĳ
é»Ħ æ²¹
ä¸ĩ äºº
è¾ ¨
åĲĳ ä¸Ĭ
éĺ¿ æĭī
çİ¯å¢ĥ ä¸Ń
è®¡ç®Ĺ åĩº
åĮĹ æŀģ
éĽĨ åĲĪ
ç»ĵ å©ļ
çļĦ æ´»åĬ¨
å®¶ çĶµ
åľŁ è±Ĩ
åĬ© æīĭ
çļĦ æ¤įçī©
å¹´ èµ·
å¸ĥ ç½®
Ġd o
æĪĳ åľ¨
åı¯ä»¥ æıĲä¾Ľ
å¼ºçĥĪ çļĦ
åº ŀ
ä¹ĺ å®¢
æīĢ å¾Ĺ
ç¿ ł
å¯¹ åħ¶
æ¸ħ æľĿ
ä¹Ķ æ²»
B A
æīĭ æľ¯
ç»ĵæĿŁ åĲİ
ou ld
è®¡ç®Ĺ åĻ¨
åĴĮ ä¸Ģä¸ª
çģ° èī²
çļĦ æ°ĽåĽ´
è£ħ ç½®
åĲĳ åīį
éľĢè¦ģ æł¹æį®
éĨ ī
æĹ º
æīĭ è¡¨
åľ¨ è¿Ļç§į
å®ļ çĲĨ
å¹¶ ä¸İ
åĲį åįķ
ä¸į ç¡®å®ļ
éĻĨ åľ°
æįŁ åĿı
å®¢ äºº
I I
åĴĮ çĽ®æłĩ
Ġel if
7 6
ä¸Ģå®ļ è¦ģ
' t
æĴĴ ä¸Ĭ
æīĭ å·¥
on t
o x
åıį å°Ħ
åĮĹäº¬ å¸Ĥ
ç»Ŀ å¯¹
å°± åĥı
èĬĤ èĥ½
å± ¿
åĽ´ ç»ķ
çļĦ ä¸įåĲĮ
èľĤ èľľ
' ]
åĪ© çİĩ
æıŃ ç¤º
æĿ ī
æ´Ĺ è¡£
ä¸ī åįģ
åıĳ éĢģ
I D
éĿ¢ æĿ¡
æķ°åŃĹ åĮĸ
èº« é«ĺ
æľĿ é²ľ
åĩĢ åĮĸ
å¹´ ç¾İåĽ½
å°Ķ å¾·
å®ĥ åľ¨
åĸ »
åĤ¨ åŃĺ
éĻ ķ
åĶ® åĲİ
é£İæł¼ åĴĮ
å¹´ åĲİ
b le
çĥ ĺ
å® ´
åı¯ä»¥ ä»İ
é»Ľ çİī
åħ¬ æ°ĳ
ç«ŀäºī å¯¹æīĭ
ĠÃ ·
å®¹ éĩı
éĽ ĩ
éĻª ä¼´
ä¹Ł è¦ģ
éĨ ĩ
éĿŀå¸¸ æľī
å¯ Ħ
AI è¯Ńè¨Ģæ¨¡åŀĭ
çĶµ æºĲ
o ve
éħį å¤ĩ
ers on
åĨĻ ä¸Ģä¸ª
åĽłä¸º å®ĥä»¬
åıĭ å¥½
éĿł è¿ĳ
198 0
æĪ¿ äº§
çļĦ åĬĽéĩı
ver s
çļĦ è¿ĲåĬ¨
ä¸Ģ çīĩ
åĮĸ çŁ³
æĪĲä¸º ä¸Ģä¸ª
çļĦ æ¦Ĥå¿µ
è© ¹
å¨ģ å»ī
çĶŁ äºİ
çı Ĭ
æ¬¾ å¼ı
é»Ħ éĩĳ
é¦Ļ èįī
çĨ Ļ
a u
ä½ľ åĩº
åŃĹ çļĦ
5 6
æ²ŁéĢļ åĴĮ
åĲ« éĩı
çĦ¶åĲİ å°Ĩ
Ġb re
æĸĩæľ¬ ä¸Ń
ï¼ļ ãĢĬ
éĢļ çŁ¥
1 20
åĴ ¸
æ¢ ³
æĻºèĥ½ åĮĸ
åľ¨ ç¾İåĽ½
æĤ Ł
çļĦ æł¸å¿ĥ
çī µ
è¿Ļ åº§
è¿ĺ è¦ģ
æĢ ĸ
4 3
éĹ °
æĭ¥ åłµ
d ata
æĻļ é¤Ĳ
ç¼ Ŀ
è¡¥ åħħ
çļĦç¨ ³
èĤ ĸ
çİ© èĢį
æĪª èĩ³
è·¯ ä¸Ĭ
åħ¬ å¹³
æķħ éļľ
çĽ® çļĦæĺ¯
æıĴ åħ¥
å¼ķ åħ¥
ç½ĳ ä¸Ĭ
è¿½ æº¯
ĠP ython
è Ł
iz e
çļĩ å¸Ŀ
æīĭ æ³ķ
çĸ² åĬ³
æ² Ī
L uc
ç²¾ åĬĽ
0 1
å®īåħ¨ åĴĮ
èĳ ¬
çļĦ åħ·ä½ĵ
æģĲ æĥ§
æĸ½ å·¥
å®¢ æľį
å¯Į åĲ«
Ġs u
æľĢ å¤ļ
èģļ ä¼ļ
åĬł åĿ¡
æľª èĥ½
éĺŁ çļĦ
äºĨ å¾Īå¤ļ
ä½ı å®ħ
åĨ Ī
æģĲ æĢĸ
Ġ qu
æĭ Ĥ
å¸ ½
ä¸įæĸŃ åıĳå±ķ
ç´§ å¯Ĩ
Ġs um
æľ¨ æĺŁ
l ass
b ers
åįĬ å¾Ħ
çŁŃ è¯Ń
ç¾½ æ¯Ľ
äºº æĢ§
çĶµåŃĲ éĤ®ä»¶
æŁ ³
Ġ &
çļĦç¨ĭ åºı
è® ·
ç»Ĩ èıĮ
å¤§ è§Ħæ¨¡
ä¹Ł èĥ½
æĸ ¤
åĩº ä»»
ç¬ ¼
åħĥç´ł çļĦ
d er
çĸ« èĭĹ
èµ° åĲĳ
èĸ ¯
æ¶Ī å¤±
èĳ¡èĲĦ éħĴ
ub lic
åİ» éĻ¤
S S
è¿Ļ é¡¹
Ġde f
å°½ å¿«
èĤ ¢
çŃī çº§
ä»¥ ä¸ĬçļĦ
å¾Ī é«ĺåħ´
é«ĺ ä¸Ń
éĢļ é£İ
åĢĻ éĢī
ä»¥ å¸®åĬ©
ä½ľ æĪĺ
7 9
çŁ³ å¤´
æĥ ĳ
è§£ è¯»
éģ ¥
åİŁ æľ¬
è¿Ļ åľº
çĥ ¦
ä¼ĺ ç¼ºçĤ¹
å¸Ĥ ä¸Ńå¿ĥ
è¿Ĳç®Ĺ ç¬¦
i an
æł ı
res ult
å¥¥ æĸ¯
èµ ´
çļĩ å®¶
e g
å®Įæķ´ çļĦ
éħį æĸ¹
å¤© ä¸»æķĻ
ãĢ ī
ãĢ Ī
ke y
åĴĮ å·¥ä½ľ
åı¶ åŃĲ
Ġ åĩĨå¤ĩ
èĤ¥ æĸĻ
é«ĺ æ¸©
æĹ¥ èµ·
ç»Ļ æĤ¨
åħ´ å¥ĭ
) ,
ic t
ä¸ŃåĽ½ åı¤ä»£
Ġw as
åĳ¨ è¾¹
æ¶ ħ
Â ²
ç¢Ĺ ä¸Ń
ç»ıåħ¸ çļĦ
æ³¢ åħ°
åĸľ çĪ±
or us
çľģ çļĦä¸Ģä¸ªå¸Ĥéķĩ
å§Ĩ æĸ¯
ä¹ ĥ
æ· ĺ
åĬł å·¥
çī¹æ®Ĭ çļĦ
æŁ ¿
ç¿ Ķ
ç» µ
çĶŁæĪĲ ä¸Ģæ®µ
åı¯ è¾¾
æĸ° åĬłåĿ¡
åĴĮ æĬĢæľ¯
æŃ¤ åĲİ
çļĦçĥ ¤
çļĦç²¾ ç¥ŀ
å½ĵ ä»Ĭ
å¸¸ çĶ¨çļĦ
èĥ ĥ
éĥ½ éľĢè¦ģ
èĭ± éĩĮ
èĻ ¹
è¿ Ł
é¦Ļ æ°Ķ
ä»ĸ æĺ¯
å½¢ å®¹
åĴĮ å¯¹
èĤ¯ å®ļ
æ´» åĬĽ
åĩı èĤ¥
é¹ °
ad d
æĭ ³
199 7
ä¸Ĭ æĺł
åħ¬ äº¤
è¿Ļ æľ¬ä¹¦
éģŃ åĪ°
æĹ ±
çļĦæĹ¶ åĮºä¸º
åĲį çļĦ
çĭ ¼
åį± æľº
é¾ Ł
________________ ________________
å®ĥä»¬ åľ¨
ç² Ĺ
åıĸ æ¶Ī
çİ¯å¢ĥ æ±¡æŁĵ
æľī ä»»ä½ķ
çŃĽ éĢī
å¼ ¥
ç¦ģ æŃ¢
éģ ®
è®¾è®¡ çļĦ
æĪĳä»¬åı¯ä»¥ éĢļè¿ĩ
Ph one
éĻĨ åĨĽ
è®° è½½
ä»¥ æıĲé«ĺ
åľ° åĿĢ
åıĪ ç§°
é¤Ĳ é¥®
ç©¿ è¿ĩ
Ġ å¹´
éĩĮ éĿ¢
Ġ1 1
çļĦ ä»»åĬ¡
å¿ĥ èĦı
Ġo per
æĺİ æ²»
æīĵ åĩ»
å¯Ĩ åĪĩ
çķªèĮĦ éħ±
çŃĸ åĪĴ
XX XX
çļĦç¾İ ä¸½
èĿ ´
æĿ° åħĭ
åĴĮ å°ı
ï¼ļ ",
èĿ´ èĿ¶
çļĦ åħī
å¾Ī éļ¾
é¥® åĵģ
ä» ²
åĪ© äºİ
åħ³ å¿ĥ
çļĦ å¤ĸ
çª ĥ
åħ» çĶŁ
æļ´ åĬĽ
çİĭ åĽ½
ç«ĭ æĸ¹
è´µ çļĦ
åİĨ ç¨ĭ
æĹ¶éĹ´ åĨħ
åĩº ä¸Ģä¸ª
é©¬ åħĭ
æ£ ī
æŁ ´
éĶ¦æłĩ èµĽ
ç®Ģ çŁŃ
åħĥ å¹´
å¤© æĸĩ
Ġ è¦ģ
å½¢æĪĲ çļĦ
an k
ĠI n
è¿Ŀ åıį
æĪ¿ åľ°äº§
èħ Ķ
éŁ §
er n
202 4
çĽ®æłĩ åĴĮ
æĻ¯ èī²
çļĦç©º æ°Ķ
æ±¤ åĮĻ
æīĭ åĨĮ
re at
éĻĦè¿ĳ çļĦ
ç²Ĵ åŃĲ
è·¯ å¾Ħ
æĢĿèĢĥ åĴĮ
çĥŃ éĹ¨
é¦Ļ åĳ³
A nd
ä»» åĳ½
çļĦçĶŁæ´» æĸ¹å¼ı
èµ ¶
ä»¥ åħ¶
è´ º
é¢Ĩ è¢ĸ
Ġ1 6
æķĪ åºĶ
ä¾ ¦
è®² ä¸Ģä¸ª
æĺ¥ å¤©
åĢ ¡
æıĲ äº¤
æĢİ æł·
è®© åŃ©åŃĲ
æ±¤ å§Ĩ
æł¹æį® ç»Ļå®ļçļĦ
åŁİ åł¡
æłĩ è®°
è¿Ĳ ä½ľ
å¹¶ ç¡®ä¿Ŀ
å°Ķ çļĦ
èĥ Ĩ
åıĹ åĪ°äºĨ
æĿ¥ è§£åĨ³
å¹¶ ä½¿çĶ¨
æľī çĤ¹
ï¼ ħ
æĪĳ ä¹Ł
è¡ °
çļĦ æĸĩæľ¬
å¯ Ĥ
Ġn ame
è¯´ æ³ķ
çī© æµģ
æ¼ Ĩ
å¸ ĺ
åľ ³
è¯Ĺ äºº
o y
é©¬æĿ¥ è¥¿äºļ
é¥° æ¼Ķ
æ³¢ åĬ¨
çļĦ åĬ¨çī©
çļĦç¨³ å®ļ
ç®Ģ ä»ĭ
éĿŀå¸¸ éĢĤåĲĪ
äºĮ å¹´
åŁº åľ°
æĦŁ æ¿Ģ
äºº å¿ĥ
å¸Ĥ åĮº
å¦» åŃĲ
åĪĽéĢł åĬĽ
é¢Ħ è®¢
ä¸ĢçĽ´ åľ¨
å¤ ķ
éĿŀ æ³ķ
ä»İ å°ı
è¯¥ åľ°
å¡ĳ éĢł
è¾¹ çķĮ
æľº è½¦
ä¼ł æī¿
Ġ å°Ĭæķ¬çļĦ
åįķ æĽ²
å¡« åĨĻ
ä¸ĸçķĮ ä¸Ĭ
è¿ĺæľī åħ¶ä»ĸ
æĺĨ èĻ«
èĳ£ äºĭ
çļĦ åħĥç´ł
str ing
ãĢį ãĢģ
p x
åį§ å®¤
5 8
åĽ¾ åĥı
çŁ¥è¯Ĩ åĴĮ
g le
æµ ı
æĳĩ æ»ļ
é¥ ±
i ke
æĪı åī§
æĸĩçī© ä¿ĿæĬ¤
æ¸ ´
åĪĩæĪĲ å°ıåĿĹ
åº¦ åģĩ
è¿Ľ åĮĸ
æľī å®³
ä¸´ æĹ¶
æĿ¥ æıĲé«ĺ
åŃ Ŀ
æĽ¾ åľ¨
èĳĹ ä½ľ
p ro
å½Ĵ ç±»
æľīæīĢ ä¸įåĲĮ
åħ¥ åı£
Ġ éĢīæĭ©
æĪĳä»¬çļĦ äº§åĵģ
å½ °
çĶŁ çĲĨ
ä¾ į
Ġli ke
å·²ç»ı æĪĲä¸º
åĽŀ åºĶ
åĳ¨ æľ«
æ·±åº¦ åŃ¦ä¹ł
s q
åı¯ åĨįçĶŁ
å¹´è½» çļĦ
s on
å°½ åĬĽ
() `
ç§į æĹı
åıĸå¾Ĺ äºĨ
ç¬¬ åħŃ
è¡¨è¾¾ å¼ı
çĪĨ çĤ¸
æĬ ¼
é¢ĳ éģĵ
éĩį å»º
çļĦ è¡¨çİ°
æľĢ åĸľæ¬¢çļĦ
æī ĩ
æľĢ é«ĺçļĦ
åħ» æĬ¤
åĴĮ åºĶçĶ¨
è¥¿ æĸ¹
å¥ĸ é¡¹
çģ¯ åħī
æĺ¯ äººç±»
æ¯« åįĩ
çļĦ æīĢæľī
e c
çģ« è½¦
d ay
æī¹ åĩĨ
çģ Į
èĩª è½¬
æĳĦ å½±
Ġ æľĢåĲİ
çĤ¹ åĩ»
H ello
éĺ² å¾¡
åıį æĢĿ
ä¸ĭ çļĦä¸Ģä¸ª
æ³ķ å®ĺ
çĹħ äºº
C T
çĶµ åĬĽ
èĩ³åħ³ éĩįè¦ģ
è¥¿ çľģ
å¢ŀåĬł äºĨ
å·ŀ çļĦ
æĸĩåŃ¦ ä½ľåĵģ
åĽŀ æĬ¥
re e
åįł é¢Ĩ
åĪĽéĢł ä¸Ģä¸ª
åĪ¶ åĵģ
å²ģ çļĦ
åĴĮ é«ĺ
è¥¿ åħ°
ä¸º ä¸»é¢ĺ
4 1
æĹ¥å¸¸ çĶŁæ´»ä¸Ń
ä¸ĭè¾ĸ çļĦä¸Ģä¸ª
æĺİçĻ½ äºĨ
æĿ¥ è¿Ľè¡Į
è¿Ľ èĢĮ
äº² å¯Ĩ
çīĽ é¡¿
çº¿ æĿ¡
ic al
è¾¹ ç¼ĺ
éĤ ĵ
çĶŁ æĬ½
ç¤¼ çī©
è¡ Ķ
å®ŀ ä½ĵ
åı¯ä»¥å¸®åĬ© æĤ¨
çĶľ çĤ¹
le x
çĥŃ éĩı
è®¸å¤ļ äºº
åħ¬åı¸ åľ¨
å®ĺ åĳĺ
199 6
ä¸į åĪ°
ç²¾ ç¡®
å½ĵ æĪĳä»¬
çĶŁæ´» ä¸ŃçļĦ
æī ¶
ä¸ĭ ä¸Ģä¸ª
èĮ Ĥ
p r
åħ¬ å°º
æĲ ¬
æĺ Ń
æĬ¤ èĤ¤
æµ· é²ľ
æŃ¥ è¡Į
åĿĲ æłĩ
é¢Ħ æľŁ
å¿ĥ ä¸Ń
æ· ĩ
è¡¨è¾¾ èĩªå·±çļĦ
åľ°çĲĥ ä¸Ĭ
s c
éĢļè¿ĩ å¯¹
çĽ¸ åĬł
æĶ Ģ
Ġ %
è¯Ħ æµĭ
åĩĨç¡® åľ°
æ¶ ¨
æĽ´ æĺ¯
èĤ² åĦ¿
éĩİ çĶŁ
Ġlo ve
å¿ į
è¿Ļ ä»½
çķ Ķ
åĪĽ ç«ĭ
åŁ Ķ
çıį æĥľ
åīį è¿Ľ
ow s
æĿ Ń
ä¸ Ľ
æĪĸ ç¼º
æĶ¹ ç¼ĸ
éī´ åĪ«
éĢĴ å½Ĵ
ä¸º ä¸Ģ
è¿ Ń
çļĦ æĦıä¹ī
è¯ Ī
èĳ Ľ
èĢģ æĿ¿
æ¯ ħ
æĺ¯ä½įäºİ ç¾İåĽ½
æľ¬ åľ°
åį¡ å°Ķ
åĩº åı£
çªĹ æĪ·
éģ £
çİ°ä»£ ç¤¾ä¼ļ
199 4
å·¥ åİĤ
æĪĺ æľ¯
æľī äºĨ
ä¸į å¿ħè¦ģçļĦ
çĭ® åŃĲ
9 6
çļĦç ħ
å¥¹ åľ¨
åįı åķĨ
å®Ŀ èĹı
Ġ ãĢĤ
ä¹ĺ ä»¥
çļĦ åŃĺåľ¨
A R
åıĳçĶŁ äºĨ
å µ
å±ķç¤º äºĨ
æĪĳä»¬ è¦ģ
äººå·¥æĻºèĥ½ çļĦ
ä¹ī åĬ¡
ä¾Ŀ çĦ¶
ä¼ł è¾ĵ
åħī åĲĪ
å¸Ĥ çļĦ
è¿Ļ å®¶
ç§ĭ å¤©çļĦ
æĥ ©
çĲĥ åľº
åı¯ä»¥ çĶ¨äºİ
å¿ĹæĦ¿ èĢħ
ç»Ļ äºĨ
æľĢ ä¸º
å¹´ åīį
å£« åħµ
ç¼ĵ æħ¢
ä¸Ģç¯ĩ åħ³äºİ
çļĦ ä½ľåĵģ
éĿ¢ åĲĳ
al se
å¸®åĬ© ä½ł
æĸĩçī©ä¿ĿæĬ¤ åįķä½į
è´Ł æĭħ
è§£æĶ¾ åĨĽ
å§Ķ ä¼ļ
æµı è§Ī
è´¢ æĶ¿
åĨħ åŃĺ
çĭ Ĳ
å®Į ç¾İçļĦ
çļĦ åıĳçĶŁ
æľĪ äº®
æ°Ķ æ°Ľ
Ġad d
ä¸Ĭ äºĨ
çħ ¸
å»ºè®® æĤ¨
ä½įäºİ æ³ķåĽ½
ä¼ĺ ç¾İ
æĸ° çĶŁ
å© Ĩ
ĠI t
çļĦçĭ Ĺ
8 6
èį£ èªī
åĹ ¯
ç¨ Ģ
çĨĬ çĮ«
ä¼ĺ éĽħ
æĥħæĦŁ åĴĮ
çĶ º
å¯¹ äººç±»
åĿĩ è¡¡
åħ¬ å¯ĵ
7 2
å®ŀéªĮ å®¤
å°Ĩ åľ¨
æĵįä½ľ ç³»ç»Ł
æĹ¥ çļĦ
æĹħ ç¨ĭ
ä¸» æ¼Ķ
è¿ĩ çļĦ
ç§ĳæĬĢ çļĦ
å¹¶ éĿŀ
åľ¨ éĢīæĭ©
å®ĩå®Ļ çļĦ
æī¿ åıĹ
ä¸ĸçķĮ æĿ¯
è¥¿ æ´ĭ
æŃ ī
å®¶ ä¸Ń
çĶŁçī© åŃ¦
æİ¨èįĲ ä¸ĢäºĽ
å¤ļ å½©
åĽ½ ä¼ļ
199 5
è¶ħ è¶Ĭ
åı¸ æ³ķ
Ġl en
Ch orus
åħĭ åħ°
è¿ĩ å¤ļ
Ġ æ¸¸æĪı
èĩ³åħ³ éĩįè¦ģçļĦ
éĢļ è®¯
åĲ ŀ
è±ª åįİ
èĤ Ŀ
ä¹Ĳ éĺŁ
å®ŀ æĹ¶
èĤ ĥ
å®Ŀ çŁ³
é¢ĨåŁŁ ä¸Ń
äº¿ ç¾İåħĥ
Ġ å®ļæľŁ
æħĪ åĸĦ
éĿŀå¸¸ æĦŁè°¢
æ¶² ä½ĵ
å®ĮæĪĲ ä»»åĬ¡
ä¼¯ çī¹
in k
æķĻ ä¼ļ
èħ Į
ä¹ĭ ä¸ĭ
æĪĳ å¯¹
e v
æĺ¯ ä¸į
åŃĹ åħ¸
åĵį åºĶ
åĶ®åĲİ æľįåĬ¡
] )
ç»Ļ äºº
åī© ä½Ļ
çŃī å¤ļä¸ª
ä¸ŃåĽ½ ä¼łç»Ł
çļĦ åģ¥åº·
ä¸Ģ çĤ¹
æİ¢ æµĭ
åŃĹ ä½ĵ
çº ¬
ä½Ĩ ä»ĸ
åħ´ å»º
ä¸įåĲĮ ç±»åŀĭçļĦ
è¾ĥ é«ĺçļĦ
å¥ ´
è¡Ģ åİĭ
åħ¬ çĽĬ
æĸ° å¢ŀ
è¸ ı
ol d
äº¿ åħĥ
ç±»ä¼¼ äºİ
åĤ¨ èĵĦ
åĴĮ ç»´æĬ¤
èĴ ĭ
çªģ çł´
çļĦ å¼Ģ
Ġ å¦Ĥæŀľä½ł
èįī åİŁ
æķĳ æı´
Į çĶŁ
åĿ Ĭ
æĮ« æĬĺ
æĸĩ ä»¶
çĽ¸ åºĶ
æ®ĸ æ°ĳ
æĪĳä»¬ å¿ħé¡»
éĩĳ é»Ħèī²
ä½ł å¯¹
çļĦ æ¸¸æĪı
ion s
éļ §
ar n
å¼¯ æĽ²
d iv
ç¨³å®ļ æĢ§
åıª éľĢè¦ģ
æĺ¯ ä¸ºäºĨ
ä¸» å¼ł
å¸® æĪĳæĥ³
Ġl a
é©¬ æĭī
ï¼ļ") )
åĲİ æŀľ
é¤Ĳ é¦Ĩ
Ġw orld
Ġ çĥ¤
è¿Ļ ä½¿å¾Ĺ
ç»´ å°Ķ
ä½įäºİ è¯¥åĽ½
æĲº å¸¦
æ¸ħ æ°´
